{"recipes":[{"title":"fair harvard","section":"drinks","tags":["drinks"],"description":"I tend to call this \"the pisco [vesper](https://github.com/caligin/actual-cookbook/tree/master/drinks/vesper.md)\". recipe from [Difford's Guide](https://www.diffordsguide.com/cocktails/recipe/5000/fair-harvard)\n","preparation":"stir with ice. garnish with lemon twist.\n","ingredients":["60ml pisco","30ml dry vermouth","3dash orange bitters","lemon peel"],"notes":"my go-to dry vermouth atm is regal rogue. using americano cocchi works quite nice too\n"},{"title":"laksa","section":"other","tags":["other"],"description":"TODO: https://www.bonappetit.com/recipe/chicken-curry-laksa\nbut sed s/chicken/prawns/g so refer to this too for the prawn bit https://www.theguardian.com/lifeandstyle/2016/feb/19/norman-musas-kari-laksa-udang-prawn-curry-laksa-recipe\nbut before adding the second half of coconut milk remove the prawns and set aside so they don't overcook\n\nall amounts halved for 2 but actually made full amount of base and stored\n","preparation":"","ingredients":["TODO"],"notes":""},{"title":"gyoza sauce","section":"sauce","tags":["sauce"],"description":"","preparation":"just mix everything together\n","ingredients":["1 spn white vinegar","1 cspn soysauce","1 cspn chilli oil or sesame oil"],"notes":""},{"title":"maison verte clone","section":"drinks","tags":["drinks"],"description":"the folks at coupette in bethnal green use to have the maison verte on the menu and it was glorious, this is an attempt to recreate something similar\n","preparation":"stirred, serve in highball glass with ice balls\n","ingredients":["50ml tequila blanco","15ml dry vermouth","1dash celery bitters","tonic to top"],"notes":"it supposedly has \"spruce\" in it, idk in which form. cordial I guess?\n"},{"title":"boosted el chapo","section":"drinks","tags":["drinks"],"description":"got the el chapo recipe wrong, turns out this is delicious\n","preparation":"mix reposado, lime juice, syrups, tincture in shaker with ice. double strain in rocks glasses with big ice chunk. float whisky on top. garnish with a mint leaf\n","ingredients":["40ml reposado tequila","30ml lime juice","10ml ginger syrup","10ml honey syrup","4 dashes hot chilli tincture","1 cspn smoky scotch whisky"],"notes":""},{"title":"har gow","section":"other","tags":["other"],"description":"steamed shrimpy deliciousness\n\nfrom: [Har Gow (Dim Sum Shrimp Dumplings)](https://thewoksoflife.com/2015/10/har-gow/)\n\nserves: a full dinner for 2 but you would normally have a few as an appetizer, not as a full main\n","preparation":"- pat dry well the shrimps before doing anything else\n- give the shrimps a good, coarse chop. the result should be mostly like a paste but with some chunkier bites around. you can use the flat of your knife to squash them first to make the chopping smoother\n- chop the bamboo shots\n- mix everything except the bamboo shots to make a paste\n- when it's sticky introduce the bamboo shots and mix again\n- cover with cling foil and leave sit in the fridge for at least 10m\n- prepare your steamer\n- fill the shells, seal and steam for 12m\n","ingredients":["300g raw tiger prawns","1cspn minced ginger","salt","pepper pepper pepper","1cspn oyster sauce","1spn vegetable oil","a pinch of white pepper","1cspn sesame oil","a pinch of salt","1cspn sugar","a handful of bamboo shots","\\[har gow shells](https://github.com/caligin/actual-cookbook/tree/master/other/har-gow-shells.md)"],"notes":"original recipe calls for 1/4 cup bamboo shots but I don't speak cups soooo a small handful it is\n"},{"title":"udp - unexpectedly, dark pale!","section":"drinks","tags":["drinks"],"description":"black ipa that was initially supposed to be a stout but hey, I had the right hops in the cupboard!\n\n## tools\n\n- brewing kit\n","preparation":"- mash in at 75c, keep mash at 62-70c for 60m\n- mash out 75c\n- have sparge water ready at 75c+, sparge\n- boil 60m, follow indications in ingredients for hop timing\n- cold break to 21c, insert in fermenter areating wort well\n- pitch dry yeast on top surface, no need to shake\n- after fermentaiton end (give it somehow like 10d) add the dryhopping and let sit for 3d\n- chill in fridge at 3c for 1d\n- bottle\n","ingredients":["900g maris otter","30g roaster barley","70g black malt","2.2l water for mash","3.8lt water for sparge","3g simcoe 60m","3g williamette 60m","4g simcoe 15m","4g williamette 15m","3g simcoe 10m","3g williamette 10m","4g simcoe 5m","3g williamette 5m","10g mosaic dry 3d","4g safale s-04"],"notes":"1g irish moss suggested in boil 5m but didn't try as I didn't have any atm\n"},{"title":"sarde in savor","section":"fish","tags":["fish"],"description":"from: [TODO I left the tab with the source recipe open on a different machine!](TODO)\n\nso I wanted to buy herring for a different thing, and got sardines by mistake instead. so I decided to go for this recipe that is traditional from the side of Italy around Venice or Trieste.\n","preparation":"- TODO I forgot, see the original recipe! but along the lines of:\n\n- slice onion\n- soak raisins in white wine\n- pan fry onion until transparent, add sugar, vinegar\n- reduce to 1/4\n- lightly toast pine seeds\n- deep fry sardines at low temp for a couple of minutes, just enough to make them lightly broned\n- combine everything in layers of sardines - everythingelse\n- let sit in the fridge overnight\n","ingredients":["2 onons","270g sardines","4spn raisins","150ml vinegar","2spn sugar","3spn pine seeds"],"notes":""},{"title":"boosted margarita","section":"drinks","tags":["drinks"],"description":"A take on Margarita with some stronger flavours\n\n## tools\n\n- shaker\n- jigger for the measures\n- strainer\n","preparation":"after squeezing limes, use remaining peel to rim the glass rind so that salt can stick to it. pour some salt on a flat surface and roll the glass over it to get the salt attached.\n\nadd everything in a shaker with ice, shake, strain in the glasses.\n","ingredients":["60ml reposado tequila","30ml lime juice","15ml triple sec","15ml simple syrup","1 half lime slice for garnish","flake salt","ice"],"notes":"30ml lime juice is approx 1 lime, littleless. Would recommend to put extra lime than less lime (so like for 2 people instead of 2 limes go 2.5 or even 3).\n\na double strain is recommended if you have a second, finer strainer\n\nsimple syrup can be replaced with maple syrup for a funny aftertaste addition\n\nif you want to morph it to a long drink, ginger beer is the way to go\n"},{"title":"truffle stout","section":"drinks","tags":["drinks"],"description":"aka protocol brewing's \"proof of wort\"\n\n## tools\n\n- brewing kit\n","preparation":"see page 128 for the beer procedure.\n\nShred the truffles with a grater and divide in half.\n\nDuring boil, add half at 20' to end of boil and half at 5'.\n","ingredients":["TODO same for hindin's chocolate stout","40g truffles"],"notes":"if you didn't get the joke you clearly don't blockchain enough.\n\nTODO finish writing the base procedure for stout\n"},{"title":"lotus root carrot spare rib soup (蓮藕豬骨湯)","section":"soups","tags":["soups, lotus-root"],"description":"Tasty, savoury soup that is comforting to have during the colder months.\n","preparation":"\nSoak the shitake, dried scallops and keep the water. Remove the shitake stems once they have soaked for around 30 mins - 1 hour.\n\nSoak the barley and tangerine skin for at least 30 minutes in cold water. Scrape off any white pith from the inside of the tangerine peels.\n\nWash the candied dates.\n\nPeel and cut the carrots, lotus root and water chestnuts into chunks.\n\nBring a cold pot of water to the boil with the ribs in it, once it's boiling leave for 5-10 minutest to purge the blood and any nasties.\n\nTake out the ribs, rinse them under cold water - make sure to wash off any blood and set aside. Pour away the water from the pot,\nrinse the pot and replenish with 4L of water. Bring water to a boil.\n\nPut the rest of the ingredients into the pot and simmer on medium heat for 1 hr 45 mins.\n\nSeason with salt before serving.\n","ingredients":["600g lotus root","500g spare ribs","4 big or 6 medium dried shitake","1 large or 3 small carrots","3 candied dates","10 water chestnuts (peeled and halved)","3 dried scallops","30g chinese pearl barley","1 dried tangerine peel","4 L of water"],"notes":""},{"title":"double greasy special","section":"meat","tags":["meat"],"description":"This is one of my favourite burger recipes. I originally came up with this with fridge leftovers but it became a thing ever since.\n\nServes 1.\n\n## tools\n\n- pan with lid\n","preparation":"- cut onion in half-circles\n- cut carrot in half-circles too (first cut in 2 along the length then slice it)\n- chop garlic fine\n- pour a big drop of oil in the pan, set fire on mid and melt the butter with the oil\n- throw all veggies in, sprinkle with a little curry powder and black pepper\n- give it just a quick stir and flip to absorb the oil/butter\n- distribute the veggies evenly in the pan\n- lay the patties on top of the veggies and close lid\n- cook until it looks like they're mostly cooked, stirring from time to time to prevent the veggies to stick\n- by that time the veggies should be golden brown too\n- flip the burgers, this time with direct contact on the surface of the pan\n- close lid and cook for a few more minutes\n- add some peppercorns on the patties, then move the veggies on top and seal with a slice of cheese\n- close lid again, set flame to low and wait a minute for the cheese to melt\n- move to a plate and pour the grease remaining in the pan on top of the cheese\n","ingredients":["2 burger patties (beef works best)","1 onion","1/2 carrot","2 cheese slices (the cheap melty one sold in slices that actually doesn't have much flavour)","black peppercorns","curry powder (rogan josh or similar is my fav)","black pepper (crushed)","oil","a cube of butter butter","2 cloves of garlic"],"notes":"You can dust the patties in flour for maximum grease retention.\n\nI generally cut an X incision on both sides of the patty to make sure it comes out well done. I seem to understand that a well-done burger is often considered heresy but I often end up freezing patties sometimes even for long so well done it is, just to be on the safe side.\n\nYep, I didn't forget about it, no bread!\n"},{"title":"okonomiyaki","section":"other","tags":["other"],"description":"aka the japanese pizza. this is the recipe for the \"foo mix v0.1.0\" but you can replace the fillings with whatever (see notes).\n\nserves 2\n","preparation":"boil water, then turn off hear, mix in dashi powder and let cool so it gets warm and not hot. shred cabbage and shiitake in strips.\n\nheat up some vegatable oil in a pan and sear prawns a couple of minutes per side, to release excess water and apply a light browning. after removing prawns, circulate dashi stock through the pan to get some extra prawny flavour.\n\nheat up some veg oil in a pan and fry the bacon streaks on one side only until not raw and golden on the bottom.\n\nin a bowl mix flour and baking soda, then slowly mix in dashi stock to form the base batter. add gyoza mix. layer shredded cabbage, shiitake and prawns on top and crack 2 eggs on it.\n\nin a large pan heat up some veg oil. while it heats up, roughly mix the contents of the bowl all together. it will look like it's missing batter but it's actually alright. pour contents in the pan and using two spatulas shape it and flatten it so it's compact. apply bacon streaks on top, fried side in contact with the batter, and press with your spatulas to some batter attaches to bacon. apply a lid and cook until crisp on bottom (~6 minutes), then flip bacon side down and cook for ~3 more minutes until bacon golden.\n\ntop with a double spiral of okonomi sauce and mayo, sprinkle nori and katsuobushi and serve.\n","ingredients":["2 egg","200g cabbage","100g flour","3g baking soda","170 ml water","3g dashi powder","7 streaks bacon","150g gyoza mix","200g cooked prawns","150g shiitake","vegetable oil","katsuobushi","nori sprinkle","mayo","okonomi sauce"],"notes":"recipe is written to make one massive okonomiyaki for 2 people but you can do 2 individual ones if you prefer, depending on cooking surface available.\n\nsee gyoza recipe for gyoza mix.\nyou don't have to use this, I happened to have some leftovers from making gyozas the day before and it's brilliant. if you don't use it. keep in mind that to substitute filling you want to maintain the ratio of \"solid\" stuff and \"paste-y\" stuff to prevent the okonomiyaki from crumbling. I'd say that if you don't use it then reduce the amount of prawns (half?) to balance and throw in the mix a combination of any or all: chives (or green onions), grated garlic, grated ginger, onion, sesame oil, soysauce.\n\nI like with the above but fillings can be whatever you like! brilliant recipe to use those fridge leftovers.\n"},{"title":"creamy mushroom tortelloni <chili>","section":"pasta","tags":["pasta"],"description":"Variation on the creamy mushroom tortelloni, with chili as the type parameter.\n\nServes 2.\n","preparation":"- chop garlic fine\n- remove stem from mushrooms and slice them\n- set pot of water on high heat to boil\n- set pan at mid heat, add chili oil and melt butter\n- have a spoonful of chili oil for yourself because it's delicious\n- add garlic, mushrooms and a sprinkle of pepper\n- cook until browned (mushrooms will first absorb all the butter then release some juices -- at that point they're pretty much done)\n- add cream and set heat to low\n- sprinkle some extra pepper for maximum pepper freshness\n- stir frequently making sure that the cream doesn't stick, cook for ~2-3 mins, just enough to have the cream thicken a little\n- when water boils, drop some coarse salt and tortelloni in the pot\n- follow instructions on tortelloni pack for how long it takes to cook, stir occasionally\n- drain tortelloni, put in a bowl, pour sauce over them and mix well\n- profit!\n","ingredients":["250g tortelloni","coarse salt","2 garlic cloves","a cube of butter (~10g)","150ml double cream","100g chestnut mushrooms","2 coffeespn loganma crispy chilli oil","pepper pepper pepper"],"notes":"Do not, under any circumstances, add the tortelloni in the water before it's boiling.\n\nMy go-to tortelloni are the chorizo-filled you can find in uk's tescos but use whichever filling you like the most. Or tortellini. Or cappelletti. or whatever you feel like.\n\nIf your pan is big enough, you can pour the drained tortelloni in the pan with sauce and give them a stir while still on low heat instead of using a bowl. Not sure it makes much difference but feels fancier.\n\nIt's probably worth deglazing the pan with something clear like vodka before adding the cream, I've not tried yet. I tried with bourbon and found that it doesn't really go well with chili imho.\n"},{"title":"lamb salsa 00ff00","section":"meat","tags":["meat"],"description":"TODO reference https://www.bonappetit.com/recipe/slow-grilled-leg-of-lamb-with-mint-yogurt-and-salsa-verde\n\nwithout bone is fine, cooking time for a ~600g chunk was less than 1.5 hour\nrecommended to use higher heat with grill first to give it a little crust then lower temp and cover with foil after ~15-20m\n\nreplace all mint with powdered paprika and harissa instead\n\nreplace mint in salsa verde with some green peppercorn in brine (if you have any)\n","preparation":"","ingredients":["TODO"],"notes":""},{"title":"teriyaki chicken","section":"meat","tags":["meat"],"description":"From: [How to make chicken teriyaki - authentic recipe with chef Dai - 鳥の照り焼き](https://youtu.be/OJ0IMjAzUzA)\n\nServes 1.\n\n## tools\n\n- aluminium foil\n","preparation":"- heat a gulp of vegetable oil very hot (enough oil to barely cover the whole surface of the pan works yoi)\n- add chicken skin side dow\n- apply salt and white pepper on top of chicken\n- turn heat down to mid-low\n- cover chicken with foil and cook for ~7 min\n- flip and cook on flesh side ~3 min (keeping covered with foil)\n- add sake and turn to high heat to deglaze\n- once alcohol is consumed turn down heat again and add teriyaki sauce\n- have the teriyaki thicken while tilting the pan/moving chicken around to absorb the sauce on all sides **except skin** so it stays crispy\n- it's ready when the sauce looks sticky-ish (usually just a few minutes)\n- get off pan, leave rest for a couple of minutes covered with foil\n- slice every thigh in 3 pieces\n","ingredients":["2 boneless chicken thighs","vegetable oil","salt","white pepper","2 spn sake","3 spn teriyaki sauce"],"notes":"If you can't find boneless thighs with the skin on get thighs with bone and debone them yourself. It's annoying but [Chef Dai has a cool tutorial on how to cut that bone away more efficiently](https://youtu.be/r0IEiU_-Fjo). I don;t recommend giving up on the skin.\n\nI pour a random amount of sake directly from the bottle. The spannometric amount is \"a couple of gulps so it distributes evenly around the circumference of the pan\".\n\nSimilarly for the teriyaki sauce, from the pan where I prepare it, \"enough to have a thin uniform layer on the whole surface of the pan\".\n"},{"title":"candied ginger","section":"sweets","tags":["sweets"],"description":"from [here](https://www.daringgourmet.com/how-to-make-crystallized-ginger/)\n","preparation":"TODO\n","ingredients":["400g ginger","400g sugar","TODO"],"notes":"awesome!\n"},{"title":"pastapascul","section":"pasta","tags":["pasta"],"description":"My friend Pascul's variant on a norcina.\n\nPreparing less than the given amount at a time is not considered acceptable for this recipe.\n\nServes 2 for an entire day, or 4 for a single meal.\n","preparation":"- remove skin from sausages and shred in small pieces (it's probably easier with your hands than with a knife)\n- set pot of water on high heat to boil\n- set pan at mid heat with olive oil\n- add sausage, 1 spn of rosemary and a sprinkle of pepper\n- cook until browned\n- add cream and set heat to low\n- sprinkle some extra pepper for maximum pepper freshness and the rest of rosemary\n- stir frequently making sure that the cream doesn't stick, cook for ~2-3 mins, just enough to have the cream thicken a little\n- when water boils, drop some coarse salt and orecchiette in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, put in a bowl, pour sauce over it and mix well\n- serve\n","ingredients":["500g orecchiette","250g firm sausage","300ml double cream","3 spn rosemary","2 spn olive oil","pepper pepper pepper","coarse salt"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nThis *has* to be done with orecchiette (I know, they're ridiculously hard to find! Even in italy tbh). And a good sausage (see notes in the notcina recipe). If you can't get your hands on either refer to the notcina recipe instead. This is an all-or-nothing.\n"},{"title":"bacon roast","section":"meat","tags":["meat"],"description":"From [Bacon-Wrapped Pork Tenderloin](https://www.bonappetit.com/recipe/weeknight-porchetta).\n\nvery simple. very tasty.\n","preparation":"TODO  \n","ingredients":["TODO"],"notes":""},{"title":"lemon poppy seed cake","section":"sweets","tags":["sweets"],"description":"Adapted from [this recipe](https://www.homecookingadventure.com/recipes/lemon-poppy-seed-pound-cake)\n\n## Lemon Glaze\n- 60ml lemon juice\n- 50g sugar\n","preparation":"Preheat oven to 160C (fan assisted oven).\n\nUse butter or oil to grease the loaf tin and coat inside evenly with flour.\n\nCombine the flour, salt, baking powder, poppy seeds and lemon zest.\n\nIn a separate bowl cream the butter with sugar and add eggs one at a time. Then add in vanilla extract and oil.\n\nGradually add flour mixture alternating with splash of milk between each heap of flour.\n\nPour the mixture into the prepared loaf tin.\n\nBake for 40 - 50 minutes hour until wooden chopstick/skewer inserted into the center of the cake comes out clean.\n\nPrepare the lemon glaze when the loaf is cooling. Dissolve the sugar in lemon juice over low heat.\n\nUse a skewer to poke the cake all over the top of the loaf and brush the lemon glaze over the warm cake.\n","ingredients":["220g plain flour","150g sugar","30g poppy seeds","2g salt","6g baking powder","zest of 2 lemons","75g softened butter","70g vegetable oil","3 eggs","1 tsp vanilla extract","120g milk"],"notes":""},{"title":"paloma","section":"drinks","tags":["drinks"],"description":"","preparation":"add everything except soda in a tom collins glass and stir to dissolve syrup. add ice to top, stir to dilute and chill lightly. top with soda. serve with a straw.\n","ingredients":["50ml tequila","65ml grapefruit juice","10ml lime juice","15ml agave syrup","soda"],"notes":"juice is approx. hald a lime and half a grapefruit\n"},{"title":"vesper","section":"drinks","tags":["drinks"],"description":"insert james bond joke here. I swear I didn't know that this was james bond's drink when I started making these. recipe from [bon appetit](https://www.bonappetit.com/recipe/vesper), copied here for ease of access.\n","preparation":"add everything in a mixing glass with ice and stir 007 times clockwise to chill. then stir a little more because 007 times clockwise sounds fine for the joke but I'm not sure it's half enough to chill well. double strain in chilled martini glass. squeeze lemon peel to express oils on drink's surface, then twist it and add to garnish.\n","ingredients":["45ml london dry gin","30ml vodka","15ml lillet blanc","lemon peel"],"notes":"delicious made with portobello road gin and russian standard vodka.\n\nyes it's stirred, not shaken.\n"},{"title":"cantonese crab","section":"fish","tags":["fish"],"description":"from [Scallion Ginger Cantonese Crab](https://thewoksoflife.com/cantonese-style-scallion-ginger-crab/)\n","preparation":"- TODO\n","ingredients":["TODO"],"notes":"you need a big work or you'll have to batch up\n\nprep some egg noodles on the side and toss them in the oil that remains in the wok at the end, it's delicious"},{"title":"samgyeopsal galbi-ish","section":"sauce","tags":["sauce"],"description":"","preparation":"mix everything, apply as marinade to pork preferably overnight\n","ingredients":["1 spring onion","2 cloves garlic","2spn soy","1spn sugar","1spn black pepper",".5spn sesame oil"],"notes":""},{"title":"softballs","section":"meat","tags":["meat"],"description":"This is my sister's meatballs recipe. The bread and milk combo makes them particularly soft.\n\nTODO quantities, what else goes in? spices?\n","preparation":"- use your hands to mix all the ingredients together\n- make some bite-sized balls\n- deep fry\n","ingredients":["meat mince","bread","breadcrumbs","milk","vegetable oil","\\?"],"notes":"TODO is there more to it?\n"},{"title":"bbq rack of pork ribs","section":"meat","tags":["meat"],"description":"adapted from BA's [Best-Ever Barbecued Ribs](https://www.bonappetit.com/recipe/best-ever-barbecued-ribs). \n","preparation":"grind salt, peppercorns, paprika, mustard seeds to a powder and use to coat evenly rack of ribs.\nuse a double layer of foil to wrap the ribs in a package, add a splash of xiaoxing before sealing.\n\nbbq on medium/high in the package for about 20m (can flip them if you want, unsure how much of a differece it makes but make sure not to spill wine).\n\nopen the package and remove foil - wine should have completely evaporated by then. use a brush to coat with sauce both sides,\nthen flip and reapply every 2-3 minutes (how long it takes for the layer exposed to fire to caramelise). repeat for 2-3 layers per side or until it looks done (about 15 more minutes).\n","ingredients":["2spn crystal sea salt","1spn black peppercorns","1spn hot smoked paprika","1spn mustard seeds",".5spn gochugaru","2spn xiaoxing wine","500g rack of pork ribs","125ml bbq sauce"],"notes":"see bbq sauce recipe in sauces section, the stickiness is a must.\n\nmy gas bbq has a lid with thermometer, mid/high reaches about 250C steady with the lid shut."},{"title":"crunchy salad","section":"other","tags":["other"],"description":"crrrrrrrrrrunchy and great with some brick chicken. sauce: [Chicken Schnitzel with Crunchy Salad](https://www.bonappetit.com/recipe/chicken-schnitzel-with-crunchy-salad)\n","preparation":"chop celery, slice radishes, set aside. slice shallot.\n\nsqueeze 1 lemon in a bowl, add shallot, add honey and season with salt. leave to rest for 10-15m. whisk in mustard and slowly add in oil, whisking to emulsify. season with more salt and pepperpepperpepper.\n","ingredients":["1 celery","1 pack of radish","1 lemon","1spn honey","1 shallot","salt","1spn mustard","3spn oil","pepper"],"notes":""},{"title":"double greasy turbo","section":"meat","tags":["meat"],"description":"A variation on the double greasy special, I found myself without carrots but leftover mushrooms one day.\n\nServes 1.\n\n## tools\n\n- pan with lid\n","preparation":"- cut onion in half-circles\n- remove stem of mushrooms and slice them\n- chop garlic fine\n- pour a big drop of oil in the pan, set fire on mid and melt the butter with the oil\n- throw all veggies in, sprinkle with a little curry powder and black pepper\n- give it just a quick stir and flip to absorb the oil/butter\n- distribute the veggies evenly in the pan\n- lay the patties on top of the veggies and close lid\n- cook until it looks like they're mostly cooked, stirring from time to time to prevent the veggies to stick\n- by that time the veggies should be golden brown too\n- flip the burgers, this time with direct contact on the surface of the pan\n- close lid and cook for a few more minutes\n- add some peppercorns on the patties, then move the veggies on top and seal with a slice of cheese\n- close lid again, set flame to low and wait a minute for the cheese to melt\n- move to a plate and pour the grease remaining in the pan on top of the cheese\n","ingredients":["2 burger patties (beef works best)","1 onion","4 chestnut mushrooms","2 cheese slices (the cheap melty one sold in slices that actually doesn't have much flavour)","black peppercorns","curry powder (rogan josh or similar is my fav)","black pepper (crushed)","oil","a cube of butter butter","2 cloves of garlic"],"notes":"You can dust the patties in flour for maximum grease retention.\n\nI generally cut an X incision on both sides of the patty to make sure it comes out well done. I seem to understand that a well-done burger is often considered heresy but I often end up freezing patties sometimes even for long so well done it is, just to be on the safe side.\n\nYep, I didn't forget about it, no bread!\n"},{"title":"bourbon sour","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients in a shaker without ice. vigorous shake to foam. add ice to shaker. shake to dilute and chill. double strain in a coupe glass.\n","ingredients":["60ml bourboun","30ml lemon juice","22.5ml honey syrup","30ml egg white"],"notes":""},{"title":"honey badger","section":"drinks","tags":["drinks"],"description":"a herbal twist on a penicillin\n","preparation":"remove leaves of half a rosemary sprig. add rosemary leaves and scotch to shaker and muddle. add the rest of ingredients and shake with ice. double strain in a rocks glass with a big ice chunk in it. garnish with s rosemary sprig.\n","ingredients":["11ml [ginger syrup](https://github.com/caligin/actual-cookbook/tree/master/drinks/ginger-syrup.md)","11ml [honey syrup](https://github.com/caligin/actual-cookbook/tree/master/drinks/honey-syrup.md)","22ml lemon juice","45ml blended scotch","15ml yellow chartreuse","rosemary sprig"],"notes":"lemon yield calls for approx half a lemon\n"},{"title":"mezcal sour","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients except bitters in a shaker without ice. vigorous shake to foam (30s). add ice to shaker. shake to dilute and chill (20s). double strain in a coupe glass. garnish with some dashed of angostura bitters.\n","ingredients":["50ml mezcal","30ml lime juice","15ml agave syrup","30ml egg white","angostura bitters"],"notes":"says 30ml egg white but more is alright\n"},{"title":"dashi","section":"other","tags":["other"],"description":"makes for about half a liter\n","preparation":"divide room temp water in 2 bowls. soak shiitake in one and kombu in other. soak katsuobushi in hot water. leave everything to soak for at least 15m then combine everything together and strain.\n","ingredients":["200ml room temperature water","500ml hot water","katsuobushi","4cm kombu","1 dried shiitake"],"notes":"adjust amounts to taste\n"},{"title":"amazake smoothie","section":"drinks","tags":["drinks"],"description":"TODO reference: https://cookingwithdog.com/recipe/amazake/\n\n(bottom of page)\n","preparation":"","ingredients":null,"notes":""},{"title":"carbonara/apocrypha","section":"pasta","tags":["pasta"],"description":"This is my favourite carbonara variant. Texture is so much nicer than spaghetti.\n\nServes 1.\n","preparation":"- set pot of water on high heat to boil\n- in the meantime heat up a pan on mid heat with a little oil\n- add diced pancetta, sprinkle with just a little white pepper and curry powder\n- fry until golden\n- in the meantime add in a bowl 1 egg and 1 yolk, enough grated parmesan to compare to the amount of egg and enough black pepper to make it real dark, then mix\n- when water boils, drop some coarse salt and pasta in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, put in a bowl, add sauce, add pancetta and mix well\n- serve\n","ingredients":["150g mezzi rigatoni","100g diced pancetta","2 eggs","grated parmesan","a pinch white pepper","a pinch curry powder","pepper pepper pepper","coarse salt","1 coffespn oil"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nDo not, under any circumstances, use cream in this recipe.\n\nThis recipe does not scale linearly on the number of eggs. For 2 I'd probably use 1 egg and 2 yolks rather than 2 and 2. But well, adjust to taste.\n\nIf you can't find rigatoni or mezzi rigatoni and can;t decide on a replacement, the point is that it needs a shape in which the pancetta cubes can get stuck into, e.g. penne tends to be too small for this while paccheri are great. If you're one for traditions then go for spaghetti or other string-type pasta.\n\nBacon lardons are the same as pancetta just less fancy and more available in the uk.\n"},{"title":"arp - amplified rice pale","section":"drinks","tags":["drinks"],"description":"\"I want to brew a rice beer but idk wtf I'mdoing and btw, hops!\"\n\n## tools\n\n- brewing kit\n","preparation":"- mash in at 75c, keep mash at 62-70c for 75m\n- mash out 75c\n- have sparge water ready at 75c+, sparge\n- boil 60m, follow indications in ingredients for hop timing\n- cold break to 21c, insert in fermenter areating wort well\n- pitch dry yeast on top surface, no need to shake\n- after fermentaiton end (give it somehow like 10d) add the dryhopping and let sit for 3d\n- chill in fridge at 3c for 1d\n- bottle\n","ingredients":["1000g extra pale","100g flaked rice","100g crystal malt","2.3l water for mash","3.8lt water for sparge","30g first gold 60m","9g east kent goldings 40m","9g fuggles 30m","1g irish moss 15m","12g citra 10m","20g amarillo dry 3d","4g safale us-05"],"notes":""},{"title":"espresso martini","section":"drinks","tags":["drinks"],"description":"Coffee deliciousness.\n\n## tools\n\n- shaker\n- jigger for the measures\n- strainer\n","preparation":"Throw everything in a shaker and mix. Use a strainer to pour in a martini glass. Decorate with coffee beans if you have any.\n","ingredients":["1 sjig kalhua","1 bjig vodka (russian standard is my go-to one)","1 bjig cold espresso (illy black very well)","ice"],"notes":"Serves 1.\n"},{"title":"sichuan aubergine stirfry","section":"other","tags":["other"],"description":"from [Sichuan Eggplant Stir Fry (Yú Xiāng Eggplant, 鱼香茄子)](https://omnivorescookbook.com/sichuan-eggplant/), replacing eggplant with aubergine because availability.\n\n### sauce\n\n- 3spn chinkiang vinegar\n- 1spn soy sauce\n- 1spn dark soy sauce\n- 1spn shaoxing wine\n- 1spn doubanjang\n- 2spn sugar\n- 1spn corn starch\n- 120ml chicken stock\n","preparation":"chop aubergine in sticks, soak in salt water for 15m. drain.\n\nchop green onions, crush garlic, mince or grate ginger.\n\ncoat aubergine in cornstarch. pan-fry in batches over medium to crisp all around (around 4-6m per batch flipping)\n\nadd all sauce ingredients in a bowl and mix.\n\nadd oil to skillet on medium heat and brown szechuan peppercorn in it, then remove the peppercorns leaving infused oil in the pan. add pork and cook through. add other ingredients and stir until fragrant. add sauce and thicken. add aubergine and give it a quick stir to combine. serve with hot rice on the side.\n","ingredients":["2 aubergines","250g minced pork","1spn szechuan peppercorns","4 green onions","8 garlic cloves","1 1inch piece ginger","8-10 dried chillies (facing heaven)"],"notes":"save the peppercorns, they're delicious and useful for other recipes!\n"},{"title":"nduja cod","section":"fish","tags":["fish"],"description":"from [Halibut with Spicy Sausage, Tomatoes, and Rosemary](https://www.bonappetit.com/recipe/halibut-with-spicy-sausage-tomatoes-and-rosemary), adapted for availability of stuff\n","preparation":"preheat oven at 190C.\n\narrange a double sheet of foil to make a parcel. layer tomato, nduja, then cod, then wine and evoo. seal, oven roas for 15-20m, depending on the fish's thickness.\n","ingredients":["250g cod","40g nduja","3 garlic cloves","1 sprig rosemary","8 cherry tomatoes","2spn white cooking wine","2spn evoo"],"notes":"can replace cod with other whitefish.\n"},{"title":"hot penicillin","section":"drinks","tags":["drinks"],"description":"perfect for when you have a cold\n","preparation":"add syrups, lemon juice and bourbon in a cup. top with hot water, stir then float single malt on top\n","ingredients":["15ml ginger syrup","15ml honey syrup","1 lemon","45ml bourbon","hot water","1 cspn single malt whisky"],"notes":""},{"title":"tiramisu","section":"sweets","tags":["sweets"],"description":"this is my grandma's prized recipe. it's just. sogood.\n","preparation":"arrange savoiardi on a tray, drench them in hot coffee and leave to absorb.\n\nseparate eggs yolks from whites in 2 different bowls.\n\nadd sugar to yolks, mix until incorporated. add grappa and mix to incorporate. add mascarpone and mix to incorporate.\n\nbeat egg whites to stiff peaks. gently fold it into the rest of the mix.\n\narrange in a deep tray a layer of 8 savoiardi, cover with half the cream mix, dust cocoa powder, repeat for a second layer. top with grated chocolate. let chill for at least 4 hours.\n","ingredients":["2 eggs","250g mascarpone","1 3-people coffee moka","16 savoiardi (sponge biscuits)","2spn sugar","cocoa powder","dark chocolate","1spn grappa"],"notes":"it's important to fold the egg white last or it will collapse (I once forgot the mascarpone as I was in arush and added it on top - that was a disaster)\n\nyour tiramisu will taste best 24h after fridging.\n\nI have no idea how much coffee is contained in a 3-people moka. I might measure next time if I remember to.\n\nif you *can pick* a grappa for this, use a barrel-aged one.\n\ntriple sec is a brilliant replacement for grappa.\n"},{"title":"fried aubergine","section":"pasta","tags":["pasta"],"description":"Serves 2\n","preparation":"- dice aubergine in ~5mm cubes\n- put in a colander, salt, toss and leave to give up liquid for 1h (if you have the time, otherwise at lease 20m)\n- chop garlic\n- set pot of water on high heat to boil\n- prepare a pan with olive oil, heat it up on high when pasta water is about to start boiling\n- add garlic and cook ~30 seconds until golden\n- add aubergine dices and half basil leaves, give it a good toss so it's evenly coated with oil\n- leave to brown without touching too much. occasionally toss every 3-4 minutes to flip the side being browned. stop cooking if browning too much but it will likely take whole pasta cooking time\n- when water boils, drop some coarse salt and orecchiette in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- reserve a couple ladlefuls of pasta cooking water\n- drain pasta, add to the aubergine pan, add a ladleful (or more as needed) of cooking water and toss\n- let sauce thicken\n- serve\n- top with remaining basil leaves and parmesan\n","ingredients":["200g orecchiette","1 aubergine","2 garlic cloves","basil leaves","parmesan","olive oil","coarse salt","table salt"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n"},{"title":"grilled spicy pork meatballs","section":"meat","tags":["meat"],"description":"From [Grilled Spicy Pork Meatballs with Nuoc Cham](https://www.bonappetit.com/recipe/grilled-spicy-pork-meatballs-with-nuoc-cham)\n","preparation":"","ingredients":null,"notes":""},{"title":"kimchijeon","section":"other","tags":["other"],"description":"from: https://www.maangchi.com/recipe/kimchijeon\n","preparation":"chop onion, mix everything in a bowl. set a pan on high and pour the mix, spreading it thinly. cook until crispy (1-2 minutes per side)\n","ingredients":["260g chopped kimchi","3spn kimchi juice","half an onion","1cspn salt","1cspn sugar","80g flour","60ml water"],"notes":""},{"title":"shooting star martini","section":"drinks","tags":["drinks"],"description":"replace vodka from base recipe from here https://craftybartending.com/cocktail-recipes/porn-star-martini/ with 55ml gin London dry. fruit yield calls from roughly 2 pfruit and 1 lime\n","preparation":"mix gin, passoa, syrup, lime juice and juice and pulp of 1 passionfruit in a shaker with ice. double strain in chilled martini or coupe glass. serve shot of champagne on side.\n","ingredients":["55ml london dry gin","15ml passoa","15ml vanilla syrup","15ml lime juice","1 passionfruit","30ml chapagne"],"notes":"lime yield calls for roughly half a lime. if you want to be fancy a.f. you can float half a hollowed passionfruit and pour the champagne inside it.\n\nany other sparkling wine would do in absence of chapagne but would recommend a cremont or brut over a prosecco (although I'm biased and not a fan of prosecco)\n"},{"title":"harissa snapper","section":"fish","tags":["fish"],"description":"TODO reference : https://www.bonappetit.com/recipe/baked-snapper-with-harissa-new-potatoes-and-spring-onions\n\nas per instructions. geed a good fish tho!\n","preparation":"","ingredients":null,"notes":""},{"title":"papaya snow fungus spare rib soup (木瓜雪耳排骨湯)","section":"soups","tags":["soups, papaya, snow fungus, cantonese"],"description":"Cantonese soup that is sweet and savoury, good for when your skin and throat is feeling dry. \n\nVery 'moisturising'.\n\nServes 4\n","preparation":"Soak the snow fungus in room temp water under soft, remove the core (dark yellow) and break into chunks. Rinse thoroughly under cold running\nwater to remove any impurities and dirt on the fungus.\n\nSoak the apricot kernels in cold water and rinse.\n\nRinse the candied dates.\n\nPrepare the papaya-remove the skin and seeds and cut into chunks.\n\nBring a cold pot of water to the boil with the ribs in it, once it's boiling leave for 5-10 minutest to purge the blood and any nasties.\n\nTake out the ribs, rinse them under cold water - make sure to wash off any blood and set aside. Pour away the water from the pot,\nrinse the pot and replenish with 1.5L of water. Bring water to a boil.\n\nPlace ribs, apricot kernels, snow fungus and candied dates into the boiling water, let it come to a boil. Let it simmer on medium heat for 1 hour.\n\nAfter 1 hour add the papaya and let the soup simmer for another 30-40 minutes.\n\nAdd salt and serve.\n","ingredients":["2 medium papaya or 1 large papaya (ripe)","20g snow fungus","500g pork ribs","25g mix of bitter and sweet apricot kernels","2 candied dates","1.5 L water","1/2 tsp salt"],"notes":"Can keep in fridge 1-2 days.\n"},{"title":"galbi","section":"meat","tags":["meat"],"description":"From [Andy Makes Grilled Short Ribs with Pickled Daikon | From the Test Kitchen | Bon Appétit](https://youtu.be/FSUx5u_5q6Y) (but without daikon)\n\nserves 2, it's halved from original recipe\n","preparation":"slice ribs thin. remove outer layer of lemongrass stalks and chop in 3 pieces each. peel ginger and chop smaller chunks. peel and crush garlic. chop chillies in smaller chunks.\n\nput chillies, lemongrass, ginger, garlic, sugar, sesame oil, vegetable oil and rice vinegar in a food processor and mix to form a sauce.\n\ncoat ribs in sauce and let marinade for at least 30 minutes\n\ngrill ribs as desired, for a 5mm thickness takes 4 minutes per side at mid-high on a griddle pan to cook to medium.\n","ingredients":["2 chillies","2 lemongrass staks","1 1.5inch chunk of ginger","2 garlic cloves",".5spn light brown sugar",".25spn sesame oil","30ml vegetable oil","3spn rice vinegar","2 beef short ribs"],"notes":""},{"title":"mana potion","section":"drinks","tags":["drinks"],"description":"There are many ways to prepare this and everything is legit as long as it looks like a mana potion. This is the recipe that I prefer atm.\n\n## tools\n\n- shaker\n- jigger for the measures\n","preparation":"Acquire alchemy skill. Farm/buy materials to level it up to at least level 375 (this can take several years).\n\nThrow all ingredients in the shaker and give it some violence.\n\nI think it should be served in a martini glass but I don't have any so I use a brewdog tasting glass instead (looks like a wine tasting glass but very small).\n","ingredients":["1 bjig blue curacao","1 bjig vodka (used the lone wolf one for this but russian standard works perfectly too)","1 bjig lemon juice","ice"],"notes":"You can technically prepare this without alchemy skill but you'll end up with something that is just a nice drink and doesn't actually refill any mana.\n"},{"title":"mushroom larb","section":"other","tags":["other"],"description":"reference: https://www.youtube.com/watch?v=rMGy4-EBb8w\n\nno comment, it's just great!\n","preparation":"soak dried shiitake until softened. roast peanuts if not already roasted, give them a #roughchop. remove stems from shiitake and dice in ~5mm cubes. dice dried shiitake toegether with them. slice chile, shallot and scallions in rounds. grate ginger and garlic. separate the lettuce leaves.\n\npour some veg oil in pan, add mushrooms, give them a quick toss to coat evenly then *don't touch them* for ~5m in which they will first loose all water then start browning on the bottom. then toss them to flip and leave for 2 more minutes & repeat until evenly browned.\n\nadd some more oil, garlic, ginger, scallions and cook for a couple more minutes.\n\nturn off heat and add half peanuts, fish sauce, shallot, chile, mint, salt (if needed). toss to mix.\n\nserve with cabbage leaves and wedges on the side and some extra peanuts on top\n","ingredients":["300g shiitake mushrooms","2 dried shiitake mushrooms","vegetable oil","roasted peanuts","3 scallions","2 garlic cloves","1inch ginger","1 shallot","1 red chile","mint leaves","1spn fish sauce","1 head lettuce","lime wedges","salt"],"notes":"can replace shiitake for aubergine & dried shrimps, it's great!\n\nlettuce works great instead of the original cabbage b/c nice crunch\n\nsavoy cabbage works too but it lacks that nice crunchiness and needs boiling for ~2 minutes and it tends to stay watery\n"},{"title":"ssamjang","section":"sauce","tags":["sauce"],"description":"this is the heavenly sauce that accompanies a korean bbq meal.\n\ncan never have enough of it!\n\nserves 2.\n","preparation":"crush the garlic and mince the chilli, then mix all ingredients together\n","ingredients":["2 cloves garlic","2 chillies","2spn gochujang","2spn miso","1spn honey","1spn sesame oil","1spn gochugaru"],"notes":""},{"title":"miso tortelloni","section":"pasta","tags":["pasta"],"description":"At some point I bought a box of miso because it's delicious, only to realize that actually I have no idea what to use it for. And I often don't have the patience for marinades, that is a common use afaik. Then there was a \"let's co-co-combo fridge leftovers\" day and this happened. Turns out to be quite good, unlike how it sounds.\n\nServes 2.\n","preparation":"- chop garlic fine\n- set pot of water on high heat to boil\n- dissolve cornstarch in water (not the one in the pot -- that's for the tortelloni), I'll refer to this as cornwater\n- set pan at mid heat and melt butter\n- throw sake, soy sauce, mirin, miso in the pan\n- add enough cornwater to dissolve the miso to the pan and stir until dissolved\n- set heat to low and leave a few minutes on a light boil to thicken\n- when water boils, drop some coarse salt and tortelloni in the pot\n- follow instructions on tortelloni pack for how long it takes to cook, stir occasionally\n- drain tortelloni, put in a bowl, pour sauce over them and mix well\n- profit!\n","ingredients":["250g tortelloni","coarse salt","2 garlic cloves","a cube of butter (~10g)","1 spn mirin","1 spn sake","1 coffeespn soysauce","2 spn miso paste","some water (~50 ml)","½ coffeespn corn flour/corn starch (whichever you call it)"],"notes":"Do not, under any circumstances, add the tortelloni in the water before it's boiling.\n\nMy go-to tortelloni are the chorizo-filled you can find in uk's tescos (yes, I didn't expect it but chorizo and miso go fairly well together) but use whichever filling you like the most. Or tortellini. Or cappelletti. or whatever you feel like.\n\nIf your pan is big enough, you can pour the drained tortelloni in the pan with sauce and give them a stir while still on low heat instead of using a bowl. Not sure it makes much difference but feels fancier.\n"},{"title":"char siu","section":"meat","tags":["meat"],"description":"From [CHAR SIU RECIPE - MELT IN YOUR MOUTH CHINESE BBQ PORK](https://youtu.be/c0ICMcuhdPg).\n\nI couldn't find all the necessary ingredients easily and couln't be asked to go all the way to Chinatown to find them so the ingredients listing includes my replacements.\n\nServes *some*, depending on how much pork you get.\n\n## tools\n\n- sealable plastic bag\n- cooking brush\n","preparation":"- mix everything (except the pork)\n- put pork in plastic bag\n- pour mix in bag\n- use bowl of water to get rid of air\n- massage to have the meat covered in sauce uniformly\n- leave in fridge overnight\n- add some cornflour in the bag and massage to even out\n- place pork on oven tray with some foil and pour the remainder sauce in a bowl\n- bake for ~120 min at 200C flipping over every 10 min\n- after the first two turns start brushing the sauce on the surface everytime you flip\n- slice it up in thin-ish slices and serve. goes well as a snack.\n","ingredients":["*some* pork belly","4 spn honey","2 spn light soy sauce","1 spn mirin","1 spn loganma crispy chilli oil","1 spn oyster sauce","1 spn hoisin sauce","1/2 coffeespn five spices","2 tsp of dark soy sauce","1 spn some random indian paprika I found in the cupboard","1-2 spn corn flour/corn starch (whichever you call it)"],"notes":"Might take more or less baking time depending on the thickness. Took me so long because I cut a big piece of belly unevenly and one slice was way thicker than the other.\n\nIf you get leftover sauce it goes well brushed on an herrburger. Or on a burger in general.\n\nBrush is actually optional, you can do with a spoon tbh but it helps loads to make the coating even even on the sides.\n"},{"title":"honey syrup","section":"drinks","tags":["drinks"],"description":"as seen on [cocktail chemistry](https://youtu.be/JjW8-sBejm0), noted down here for quick access.\n","preparation":"mix together\n","ingredients":["240ml honey","80g hot water"],"notes":""},{"title":"carrot loaf cake","section":"sweets","tags":["sweets"],"description":"This recipe can also be used to make cup cakes, just adjust the cooking time and use the poke test (chopstick comes out clean) for timing.\n\nThis cake keeps well in the fridge for a few days and stays moist.\n\nLeave mascarpone out at room temp for a few hours as if you make the icing with cold soft cheese it will be lumpy.\n\nTo rectify lumpy icing you can whisk it a bit over a baine-marie.\n\n## Icing\n\n- 50g butter (room temp)\n- 150g mascarpone cheese (room temp)\n- 50g icing sugar,sifted\n- 1/2 tsp vanilla extract\n","preparation":"Prep loaf tin - either by using a bit of oil and then flour coat the inside or add a strip of baking paper length ways long enough for edges to hang over the side.\n\nHeat oven to 160C for fan assisted oven.\n\nMix flour, sugar, bicarb of soda, spice and orange zest.\n\nWhisk eggs and oil then stir into the flour mixture. Add grated carrot and mix.\n\nBake for 30 mins until the poke test passes.\n\nLet the loaf cool before icing.\n\nFor the icing, beat the butter in stand mixer and then beat in the mascarpone, icing sugar and mix. Ice the loaf.\n","ingredients":["200g grated carrot","zest of 1 orange","200g self-raising flour","110ml neutral oil","75g brown caster sugar","3 eggs","2 tbsp all spice","1 tsp bicarbonate of soda"],"notes":""},{"title":"courgette soy fritos","section":"pasta","tags":["pasta"],"description":"A.k.a pasta with fried courgettes and soy sauce. I know, the pun attempt on the name of this is pathetic.\n\nServes 1.\n","preparation":"- set pot of water on high heat to boil\n- slice courgette in discs\n- pan fry them at mid-high heat in vegetable oil until brown and crispy. this would take ~10-15 mins\n- when water boils, drop some coarse salt and pasta in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, put in a bowl, drop courgettes and dark soy sauce on top and give it a mix\n- serve\n","ingredients":["130g pasta (penne works best imho)","coarse salt","1 courgette","vegetable oil","2 spn dark soy sauce"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nIf you have a microwave with a \"crisp\" function, you can use that for the courgettes instead of pan prying them.\n\nI'm not sure exactly how much oil you need, I go for \"enough to almost cover the surface of the pan\" and it's generally alright.\n\nWatch out for the dark soy sauce, it's super easy to drop too much because it doesn't look it's much but it's probably hiding on the bottom of the bowl and would make your pasta soggy and ridiculously salty.\n"},{"title":"ginger syrup","section":"drinks","tags":["drinks"],"description":"as seen on [cocktail chemistry](https://youtu.be/JjW8-sBejm0), noted down here for quick access.\n","preparation":"mix together\n","ingredients":["120ml ginger juice","100g sugar"],"notes":"ginger yield calls for approx 500g ginger\n"},{"title":"chocolate chip cookies","section":"sweets","tags":["sweets"],"description":"adapted from [Chris Makes Chocolate Chip Cookies](https://video.bonappetit.com/watch/from-the-test-kitchen-chris-makes-chocolate-chip-cookies), with extra chocolate cheat codes.\n","preparation":"preheat oven to 180C. whisk flour, salt, baking soda and set aside.\n\nmelt butter (113g) over medium until it foams and browns, let cool. cut rest of butter in small pieces and add to melted butter. let all butter melt.\n\nadd sugars to butter and incorporate. add egg and yolks and mix to dissolve sugar. whisk in vanilla. fold the dry ingredients in with a spatula. fold in chocolate.\n\nportion in 16 balls. bake them for 8-10m\n","ingredients":["200g plain flour","2cspn vanilla","4g salt","4g baking soda","56g butter","113g butter (melted)","200g brown sugar","50g granulated sugar","1 egg","2 egg yolks","200g chocolate"],"notes":""},{"title":"silken","section":"drinks","tags":["drinks"],"description":"","preparation":"build in a highball glass with ice, top with ginger beer and give it a stir\n","ingredients":["30ml vodka","30ml dry vermouth","15ml lime juice","7.5ml honey syrup","ginger beer to top"],"notes":"original recipe called for gigner ale but methinks beer is better\n"},{"title":"spanish russian","section":"drinks","tags":["drinks"],"description":"White russian, but with [crema de cerveza](https://mrquijote.com/producto/licor-crema-de-cerveza/).\n\nSo I found this crema de cerveza thing on a trip to spain, bought on a spike of compulsive curiosity then moved to be underwhelmed about it for months after tasting. then I had the idea of using it in a white russian...\n","preparation":"add coffee liqueur and vodka straight in a rocks glass with a big chunk of ice. give it a little stir. add milk, crema de cerveza and 2 cubes of ice to a shaker and shake heavily until ice almost dissolved. strain with a hawthorne strainer on top of ice chunk to layer.\n","ingredients":["15ml coffee liqueur","30ml vodka","15ml whole milk","15ml crema de cerveza"],"notes":""},{"title":"aleksandr","section":"drinks","tags":["drinks"],"description":"my take on an alexander\n\n## tools\n\n- shaker\n- jigger for the measures\n- strainer\n","preparation":"add gin, doublecream+milk mix, syrup and ice in shaker. show it some hell. strain pour in glass and garnish with powder\n","ingredients":["45ml gin","45ml milk","15ml vanilla syrup","raspberry powder","ice"],"notes":"I don't remember which powdery things are legit on this but I seem to remember that raspberry is dope. should totally try chili and paprika though, sounds fun.\n"},{"title":"soft boiled egg","section":"other","tags":["other"],"description":"I can never remember how long it needs to cook\n","preparation":"- boil water\n- put egg in boiling water\n- time exactly 6 minutes\n- put egg in ice cold water\n","ingredients":["1 egg"],"notes":"then to break the shell without making too much of a mess gently press with the palm of your hands while rolling the egg on a flat surface\n"},{"title":"galbi jim","section":"meat","tags":["meat"],"description":"### serves \n2 -3 people.\n\n### cooking time \n2 hours (including prep)\n","preparation":"Pre-soak the shitake in advance and keep the water for the sauce. Remove the stems from the shitake and cut into halves or quarters depending on the size.\n\nMix the mirin, soy sauce, shitake water, gochugaru, sugar, black pepper, ginger and garlic to form the sauce base.\n\nBoil the short ribs for 10 mins in boiling water to purge the impurities. Drain and rinse the short ribs in cold water to get rid of any excess blood and bone shards.\n\nReturn the ribs back into your pot (we use a dutch oven for braising) and add the sauce base. Ensure the liquid covers your short ribs, too little sauce and you run the risk of your ribs drying out.\n\nCook the ribs on high heat for 30 mins, stir ribs occasionally so they do not stick to the bottom of the pan. Turn the heat down to a simmer for another 30 mins.\n\nAdd the potatoes/radish/carrots to the ribs and simmer for another 30 mins. Then add the onions and simmer for another 10 mins. Check your ribs are fall off the bone tender - if its still tough let the braise go on for longer.\n\nTop with spring onions and chilli for garnish. Serve with rice and kimchi.\n","ingredients":["1kg beef short ribs (ask butcher to cut to approx 10cm chunks)","130 ml mirin/cooking sake/soju","100 ml soy sauce","900ml shitake soaking water","5 medium - large dried shitake (soak for a few hours)","30g sugar","3 - 5 tbsp gochugaru (korean pepper flakes)","10 cloves of minced garlic","nub of ginger, minced","black pepper","1 onion, cut into bite sized pieces","1 spring onion, finely sliced","1 chilli, finely sliced","2 - 3 medium sized potatoes or korean radish, cut into chunks","1 - 2 carrots (optional)"],"notes":""},{"title":"herrburger","section":"meat","tags":["meat"],"description":"That stays for \"herb burger\" but with the wrong double consonant to maximize confusion.\n\nThis is a reidiculously low effort burger but I thought reporting the spice combo was worthwile\n\nServes 1.\n","preparation":"- sprinkle pepper, majoran, nutmeg and thyme on both sides of patties\n- melt butter on mid-high fire\n- apply meat in pan\n- cook however you prefer it\n- ggwp\n","ingredients":["2 burger patties (beef works best)","black pepper","thyme","majoran","nutmeg","butter","a drop of oil or 4"],"notes":"I generally cut an X incision on both sides of the patty to make sure it comes out well done. I seem to understand that a well-done burger is often considered heresy but I often end up freezing patties sometimes even for long so well done it is, just to be on the safe side. A pan with a lid also helps in that scenario.\n\nIf you want it rare or however else, go for it!\n\nYep, I didn't forget about it, no bread!\n"},{"title":"gcp pappardelle","section":"pasta","tags":["pasta"],"description":"garlic, cream cheese, prawns.\n\noriginal from [here](https://www.yummly.co.uk/recipe/Garlic-_-Chili-Prawn-Tagliatelle-1195861#directions)\n\nfeeds me and someone else\n","preparation":"- mince garlic and chilli\n- slice cherry tomatoes in half\n- set pot of water on high heat to boil\n- set pan at mid heat with oil\n- add garlic and chilli and fry for a few seconds\n- add white wine and reduce by half\n- add prawns, fry for a minute or two until cooked through\n- remove prawns and set them aside to avoid overcooking\n- add cream and cherry tomatoes, stir to mix even and let simmer\n- when water boils, drop some coarse salt and tagliatelle in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, pour in sauce pan, add back prawns and toss with sauce to mix\n- sprinkle some extra pepper for maximum pepper freshness\n- top with fresh basil leaves\n- serve\n","ingredients":["180g pappardelle","evoo, (or olive oil if you're not an hipster)","1 garlic clove","1 chilli","150ml white wine","200g cream cheese","200g raw king prawns","~10 cherry tomatoes","handful fresh basil","pepper pepper pepper","coarse salt"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nif you have no idea what cream cheese is like I did, that's aka philadelphia. recipe calls for 200g but a standard philadelphia box is 180g and works perfectly.\n\noverprawning (like, 300g) is perfectly fine. would suggest to lightly overcherrytomato with it too\n\nyou can replace philadelphia with double cream too, does not come out as good though and you def need to boil it a little before simmering to thicken.\n\nyou can replace pappardelle with tagliatelle if you can't find any but pappardelle are just somuchbetter\n"},{"title":"basil sour","section":"drinks","tags":["drinks"],"description":"a take on white lady\n","preparation":"juice lime. reverse dry shake egg white. (combine all ingredients except egg white in shaker with ice, shake to chill, discard ice, add egg white to mixture, shake to foam).\ndouble strain in coupe glass.\n\ngarnish with a small basil leaf\n","ingredients":["50ml london dry gin","8 leaves basil","15ml simple syrup","1 lime","1 egg white"],"notes":""},{"title":"green pepper fillet","section":"meat","tags":["meat"],"description":"Credits to [@sbaruzza](https://github.com/sbaruzza) for this recipe.\n\nHere in the uk there is this ridiculous tradition of getting a perfectly fine steak, politely (and by poliltey I mean passive-aggressively) send it back to the kitchen because it was too exactly-rare-as-you-asked, get the same exact steak back from the kitchen 5 minutes later, rejoice for having contributed to right the wrongs of the world and then *pour a generous amout of a peppercorn sauce you ordered on the side on your steak of justice, just enough to completely drown it*.\n\nI cannot possibly understand this unless you make the peppercorn sauce proper part of the cooking process to join the flavours together. This is what this recipe is about.\n\nServes 2. Result is medium-rare.\n\n## tools\n\n- kitchen twine\n","preparation":"- tie some kitchen twine around the fillets so that they retain a circular shape during cooking\n- crack half of the green pepper and rub it on both sides of fillets so it sticks\n- sprinkle salt\n- melt butter, fire on mid-high\n- cook fillets 3 minutes ∀ side\n- take fillets off pan and leave them on the side\n- lower flame to mid-low\n- deglaze pan with a gulp of brandy or twenty\n- use a wooden spoon or similar to make sure that there are no residuals are sticking to the pan and they all become part of the sauce\n- have gulp of brandy for yo'self\n- when brandy is mostly evaporated add mustard, cream and remaining peppercorns and stir for ~1 minute\n- add the fillets back in and cook 1m ∀ side\n- serve drowned in sauce\n","ingredients":["2 beef fillets (~300g each)","~4 spn double cream","~1 spn mustard","~4 coffeespn green pepper in brine","50g butter","brandy","salt"],"notes":"If you're lucky enough or your fillets are firm enough that you don't need twine.\n\nIf you do the deglazing + sauce with a flame too high it won't become creamy and you risk setting the brandy on fire that is not what you want so watch out.\n"},{"title":"agua-de-lourdes","section":"sauce","tags":["sauce"],"description":"aka the flatfish moisturiser.\n\nmake this in a squeezy bottle and use liberally when cooking big flatfish on a bbq, like a brill or turbot.\n\nthe real deal is used in a famous turbot resaurant in spain - I have no idea what's in the og one or whether this is even close but the intended usage is the same.\n","preparation":"pour in a squeezy bottle, shake vigorously to emulsify. reshake before each use.\n","ingredients":["15g salt","60g rice vinegar","15g moscatel vinegar","40g extra virgin olive oil"],"notes":""},{"title":"gyudon","section":"other","tags":["other"],"description":"from: [Gyudon (Japanese Beef Bowl) 牛丼](https://www.justonecookbook.com/gyudon/)\n\nquick, filling and tasty (but indeed requires a rice cooker)\n\nserves 2.\n","preparation":"prepare rice in a rice cooker.\n\nslice 1 onion. chop scallions and set aside. slice thinly benishoga and set aside.\n\nheat oil over medium heat and cook onions until soft. add meat and sugar, toss to mix and cook until no longer pink. add sake, mirin and soysauce and simmer for 3 minutes to reduce a little.\n\nplace rice in 2 bowls, put meat&sauce mix on top leaving a little crater in the center. crack eggs, reserve white and put yolk in the center of bowl. top with scallion and benishoga.\n","ingredients":["sushi white rice for 2","1 or 2 steaks (rump or sirloin)","1 onion","1spn sugar","2spn sake","2spn mirin","2spn soysauce","benishoga (red pickled ginger)","3 scallions","2 eggs","veg oil"],"notes":"amounts and preparation for the rice is left as an exercise for the reader. yumenishiki pink is my fav brand for this.\n\noriginal recipe calls for 1spn soysauce but go 2 or it's not salty enough\n\nreserved egg whites can be used in a cocktail e.g. whisky sour, fridge them in a bowl to use later.\n"},{"title":"south side","section":"drinks","tags":["drinks"],"description":"","preparation":"add everything in a shaker with ice, giving a slap to the mint leaves. shake and double strain in a coupe glass. top with a mint leaf.\n","ingredients":["20ml lime juice","20ml simple syrup","50ml london dry gin","6 mint leaves"],"notes":""},{"title":"pisco sour","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients except bitters in a shaker without ice. vigorous shake to foam (30s). add ice to shaker. shake to dilute and chill (20s). double strain in a coupe glass. garnish with some dashes of bitters.\n","ingredients":["60ml pisco","15ml lime juice","15ml lemon juice","22.5ml simple syrup","1 egg white","angostura bitters"],"notes":"says 30ml egg white but more is alright\n"},{"title":"that weird orange cocktail","section":"drinks","tags":["drinks"],"description":"not sure how I came up with this - I think there was some stray orange that needed using in the fridge and adapted some random recipe from the internet to what I had at hand\n","preparation":"shake all ingredients, double strain.\n","ingredients":["45ml smoky whisky","22.5ml lemon juice","22.5ml simple syrup","15ml gran classico","15ml orange juice","2 dash orange bitters"],"notes":"smoky whisky can be replaced with mezcal. gran classico can be replaced with some other sweetish herbal amaro, but it *must* have an orange peel component."},{"title":"millionaire-martini","section":"drinks","tags":["drinks"],"description":"","preparation":"stir gin and vermouth, top with champagne in glass.\n","ingredients":["50ml gin","20ml dry vermouth","30ml champagne"],"notes":null},{"title":"sage tortellini","section":"pasta","tags":["pasta"],"description":"This is one of the lowest effor recipes ever.\n\nServes 2.\n","preparation":"- set pot of water on high heat to boil\n- when water boils, drop some coarse salt and tortellini in the pot\n- follow instructions on tortellini pack for how long it takes to cook, stir occasionally\n- set pan at mid heat and melt butter\n- drain tortellini well\n- add drained tortellini to the pan and sprinkle with sage\n- cook for 2 more minutes stirring to coat tortellini in butter and sage evenly\n- serve\n","ingredients":["250g tortellini","coarse salt","50g butter","2 spn sage"],"notes":"Do not, under any circumstances, add the tortellini in the water before it's boiling.\n\nChoice of tortellini filling is yours. Tortelloni works too but they tend to get too soft before adding to the pan. Consider cooking them for slightly less than instructions to avoid sogginess.\n\nI specified 2 spn sage assuming it dried. If you have fresh sage tear the leaves in 3-4 pieces and use that. Or chop them if you prefer.\n"},{"title":"norcina/alter","section":"pasta","tags":["pasta"],"description":"For when you get your hands on the proper fresh sausages.\n\nServes 2+ (2 hungry|2 + leftover for lunch|you can stretch it to 4 if you're having a second course).\n","preparation":"- chop shallot fine\n- remove rosemary leaves from stem and give them a rough chop\n- remove skin from sausages and shred in small pieces\n- set pot of water on high heat to boil\n- set pan at mid/high heat and drizzle olive oil\n- add shallot and fry for a minute or two until lightly golden\n- add sausage, a generous sprinkle of rosemary (around half of it) and a sprinkle of pepper\n- cook until browned\n- set heat to high, deglaze pan with a gulp of white wine\n- add cream and set heat to low\n- sprinkle some extra pepper and rest of rosemary for maximum freshness \n- stir frequently making sure that the cream doesn't stick, cook for ~2-3 mins, just enough to have the cream thicken a little\n- when water boils, drop some coarse salt and orecchiette in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, add to the pan whit sauce and combine\n- serve\n","ingredients":["250g orecchiette","240g fresh sausage (4 sausages in my case)","200ml double cream","1 shallot","1 sprig rosemary","olive oil","dry white wine","pepper pepper pepper","coarse salt","seasoning salt"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nYou really need fresh sausages for this, the type you get in Italy. Not easy to get your hands on, I know. Make sure that you get something that is just seasoned (salt & pepper) and with no added flavours, just good meat will become the centerpiece of the dish on its own without the need for extras.\n\nIf you're making this might as well splurge a bit on the wine too and get something nicey instead of the cheapest 100-mills bottle you can get your hands on at the coop.\n\nLastly, if you're up to go an extra length you can do this little ritual with the sausages before introducing the shallots in the pan: medium heat, cut the sausages along and open them in half (with the skin still on) and put them in skin side down. After a minute or so they will start curling up as the skin shrinks. Remove them from the pan, then proceed to remove skin and follow rest of recipe as normal. This will make so some extra fat from the skin stays in the pan whith the oil."},{"title":"gochujang noodles","section":"other","tags":["other"],"description":"serves 2\n","preparation":"prepare noodles as per their instructions.\n\nmix together gochuchang, sesame oil and soysauce to prepare the sauce.\n\nfry two eggs and set aside.\n\nstirfry kimichi\n","ingredients":["any noodles you like","1 spn gochujang","1 spn sesame oil","1 spn soysauce","1 spn toasted sesame seeds","1 spn nori sprinkle","2 egg","kimichi","2 spring onions"],"notes":""},{"title":"yakushima negroni","section":"drinks","tags":["drinks"],"description":"like a negroni, but with local shochu from yakushima\n","preparation":"shortly stir all ingredients in a tumbler glass with ice to dilute and chill. garnish with orange slice.\n","ingredients":["40ml 屋久島「大自然林」焼酎","20ml campari","20ml sweet vermouth","orange slice"],"notes":""},{"title":"tangerine stout","section":"drinks","tags":["drinks"],"description":"## tools\n\n- brewing kit\n- moka (sized for 3 servings)\n","preparation":"see page 128 for the beer procedure.\n\nZest the skin of 3 tangerines and use the zest to load a moka. Set it up as if you were preparing coffee, let it cool down then add in the fermenter together with wort.\n","ingredients":["TODO same for hindin's chocolate stout","3 tangerines"],"notes":"Steaming the zest this way takes the flavour out and keeps the oils in the filer so you can get rid of some elements that don't play well with your batch. Note that the moka will complete steaming much much faster than coffee so keep an eye on it.\n\nTODO finish writing the base procedure for stout\n"},{"title":"bothainical garden","section":"drinks","tags":["drinks"],"description":"green, refreshing and absolutely delicious! recommende with hot chilli seafood recipes, this drink goes beautifully with the heat\n\n## tools\n\n- shaker\n- jigger for the measures\n- strainer\n","preparation":"remove outer layer of lemongrass and cut in chunks ~2cm long\n\nmuddle thai basil and lemongrass in a shaker\n\nadd all the rest of ingredients and ice to the shaker\n\nshake, strain in glasses\n\ngarnish with half a lime slice and/or a leaf of thai basil or 2\n","ingredients":["a few leaves thai basil","1 lemongrass stalk","1/2 lime","2sjig vodka","tonic","1/2 sjig sugar syrup","ice"],"notes":"if you can't find thai basil keep in mind that normal basil is *not* the same thing at all and I would not recommend as a replacement\n"},{"title":"hirata buns","section":"other","tags":["other"],"description":"soft fluffly dreams of deliciousness\n\nfrom: [Hirata Buns](https://www.japancentre.com/en/recipes/809-hirata-buns)\n\nthis is the recipe for the buns, filling is up to you. a mix of [chasfoo](https://github.com/caligin/actual-cookbook/tree/master/meat/chasfoo.md) and [buttersoy mushrooms](https://github.com/caligin/actual-cookbook/tree/master/other/buttersoy-mushrooms.md) is highly recommended and (consistently successful at house parties).\n\nserves: whoever can eat 6 buns\n\n## tools\n\n- steamer\n- baking paper\n","preparation":"- sift the flour\n- mix all the dry ingredients\n- add water, mix to make dough\n- cover with a damp towel and leave to raise for at least 1h\n- separate in 6 pieces\n- use the sesame oil on your hand and around the ball of dough you're working to prevent it from sticking\n- make a flat, long oval shape then fold on itself in half. the light sesame oil coating should prevent it from merging on its own\n- put on a piece of baking paper and steam 12m\n","ingredients":["300g flour","3g yeast","3g baking powder","35g sugar","salt","170ml lukewarm water","sesame oil"],"notes":"I never remember to sift the flour and my dough always came up very lumpy and not as soft as it could be so I highly recommend sifting the flour. if you try that and find out that's not what makes the different send me a pr lol\n"},{"title":"shioyaki mackerel","section":"fish","tags":["fish"],"description":"From [Mackerel recipe - How to grill salted mackerel - サバのしおやき](https://youtu.be/askf71pqrPY)\n\nServers 1.\n\n## tools\n\n- (optional) skewers\n","preparation":"- preheat oven, upper grill settings at 200C\n- cut some cross-cut incisions on the skin side so it doesn't curl up while grilling\n- cut fillets in half\n- use 3 skewers in a V shape to support 2 pieces during cooking\n- apply some coarse salt to taste on both sides\n- skin side down first, 5 minutes then 3 with skin side up\n","ingredients":["2 mackerel fillets","coarse salt"],"notes":"I wrote serves 1 but I usually serve this as an appetizer for 1 not as a main. Or as a snack.\n\nKeep the fish reasonably close to the top grill of the oven. This way you don't even need to close the oven in case the skewers don't fit.\n\nTo remove the skewers without exploding the fish apply a spinning motion on the skewer while extracting it.\n\nYou can do without skewers as long as you have a way to get the fish out to flip it.\n\nAlso, you either have a very sharp knife or you risk demolishing the fish while applying the cross-cuts, you might be better of without if your blade is not vorpal +5.\n\nServers on top is not a typo, it's a very elaborate pun.\n"},{"title":"double greasy turbospecial","section":"meat","tags":["meat"],"description":"Refer to *double greasy special* and *double greasy turbo*. If you can't decide between carrots and mushrooms, well, then…\n\n**WHY NOT BOTH?**\n\nServes 1.\n\n## tools\n\n- pan with lid\n","preparation":"- dice onion\n- dice carrot\n- remove stem of mushrooms and dice them\n- chop garlic fine\n- pour a big drop of oil in the pan, set fire on mid and melt the butter with the oil\n- throw all veggies in, sprinkle with a little curry powder and black pepper\n- give it just a quick stir and flip to absorb the oil/butter\n- distribute the veggies evenly in the pan\n- lay the patties on top of the veggies and close lid\n- cook until it looks like they're mostly cooked, stirring from time to time to prevent the veggies to stick\n- by that time the veggies should be golden brown too\n- flip the burgers, this time with direct contact on the surface of the pan\n- close lid and cook for a few more minutes\n- add some peppercorns on the patties, then move the veggies on top and seal with a slice of cheese\n- close lid again, set flame to low and wait a minute for the cheese to melt\n- move to a plate and pour the grease remaining in the pan on top of the cheese\n","ingredients":["2 burger patties (beef works best)","1 onion","1/2 carrot","4 chestnut mushrooms","2 cheese slices (the cheap melty one sold in slices that actually doesn't have much flavour)","black peppercorns","curry powder (rogan josh or similar is my fav)","black pepper (crushed)","oil","a cube of butter butter","2 cloves of garlic"],"notes":"You can dust the patties in flour for maximum grease retention.\n\nI generally cut an X incision on both sides of the patty to make sure it comes out well done. I seem to understand that a well-done burger is often considered heresy but I often end up freezing patties sometimes even for long so well done it is, just to be on the safe side.\n\nYep, I didn't forget about it, no bread!\n\nThe dicing instead of using the cuts described in the other two recipes is because my pan barely fits everything at once so dicing makes it easier to move stuff around and defrag available space. Beware of dicing too fine though, it burns right away otherwise!\n"},{"title":"prawn fritolin","section":"fish","tags":["fish"],"description":"fritolin is a battered fry of mixed small fishos. this version is just with prawns - because that's what we got on the day but you can throw anything bite size in it really\n","preparation":"mix egg, flour and soda in a bowl and rest covered in the fridge for 30m.\n\nheat frier at 190C, dip fish in batter, lighlty drain and fry for ~90s\n","ingredients":["400g prawns","1 egg white","175g flour","280ml soda"],"notes":""},{"title":"banana bread","section":"sweets","tags":["sweets"],"description":"This recipe is adapted from [BA's best banana bread](https://www.bonappetit.com/recipe/banana-bread). Conversions to grams because we don't use cups and sugar has been reduced as the original is too sweet. I find that if you use super ripe bananas it makes the addition of chocolate redundant as you already get those sweet, chocolatey notes from the mashed and cooked banana. \n","preparation":"Pre-heat oven to 170 C. \n\nGrease and line loaf tin/or dust inside with flour.\n\nMix flour, baking soda and salt in a bowl.\n\nCream the butter and soft brown sugar till soft and fluffy in a stand mixer for a few mins on medium speed, then add in the mascarpone. Beat until the mixture looks smooth and fluffy.\n\nAdd egg one at a time and beat until incorporated.\n\nSet mixer on low and add flour slowly.\n\nFold in the mashed bananas.\n\nTransfer mixture to the loaf tin and sprinkle a dusting of brown caster sugar on top - this gives the crust some nice crunch.\n\nBake for 45 mins and check that the chopstick/skewer comes out clean.\n","ingredients":["192g plain flour","1 1/4 tsp baking soda","pinch of salt","150g light brown sugar","sprinkle of brown caster sugar","125g mascarpone (room temp)","57g softened butter","2 eggs","dash of vanilla extract","4 mashed bananas <!-- To Do: Add banana weight -->"],"notes":""},{"title":"mushroom risotto","section":"other","tags":["other"],"description":"serves 2\n","preparation":"put dried porcini in hot water to rehydrate. dice shallot. heat some olive oil in a pan over medium head and add diced shallot, cooking until translucent (temperature hint: the goal at this point is to have the shallot sweat, not to brown). add shiitake and sautee over high heat until browned. remove shiitake (you can leave the shallot in). add rice and vermouth and stir until rice absorbed vermouth and looks translucent at the edges. lower heat to mid, add porcini and their liquid and stir until absorbed. add stock little by little (50ml at a time-ish) and stir until absorbed before adding the next batch. after 15 minutes add shiitake back in and salt to taste. repeat adding stock until desired creaaminess/rice softness point, tipically after 20-25 minutes and  500ml of stock used. serve with a light coating of pepper and parsley.\n","ingredients":["100ml arborio rice","1 shallot","150g shiitake","1 handful of dried porcini","50ml dry vermouth","1l stock","olive oil"],"notes":"rice measured in ml is weird, I know, but recipe is adapted from one in cups and I didn't do the weight conversion yet.\n\nrecipe calls for 1l of stock but you are expected to use only half of it -- having loads ready is good so that if your rice absorbs too much too fast you have extras at hand and you don't risk burning everything.\n\ndo not, under any circumstance, wash arborio rice. risotto rice is meant to stay starchy to create the creaminess that you want in your risotto and cleaning it would get rid of that starchiness.\n"},{"title":"pornstar martini","section":"drinks","tags":["drinks"],"description":"it's not funny, it's delicious. or rather, it's so delicious it's not even funny. recipe adjusted from [crafty bartending](https://craftybartending.com/cocktail-recipes/porn-star-martini/)\n","preparation":"mix vodka, passoa, syrup, lime juice and juice and pulp of 1 passionfruit in a shaker with ice. double strain in chilled martini or coupe glass. serve shot of champagne on side.\n","ingredients":["45ml vodka","15ml passoa","15ml vanilla syrup","15ml lime juice","1 passionfruit","30ml champagne"],"notes":"lime yield calls for roughly half a lime. if you want to be fancy a.f. you can float half a hollowed passionfruit and pour the champagne inside it.\n\nany other sparkling wine would do in absence of chapagne but would recommend a cremont or brut over a prosecco (although I'm biased and not a fan of prosecco)\n\noriginal recipe calls for vanilla vodka but tbh I'd rather go for plain vodka instead. russian standard and lone wolf work beutifully.\n"},{"title":"gyoza","section":"other","tags":["other"],"description":"From: [How to Make Yaki Gyoza (Fried Dumpling Recipe) | Cooking with Dog](https://youtu.be/r8MBX-SXnmg)\n\nServes: 2\n","preparation":"great garlic and ginger. dice fine cabbage, onion, chives.\n\nmix in a bowl pork mince, grated garlic, grated ginger, soysauce, sugar, pepper, sake, sesame oil, potato starch and oyster sauce until uniform.\n\nadd cabbage, onion, chives and mix again until uniform. cover with clingfilm and let rest for at least 10-15 minutes\n\ndust flour on a tray and keeping a bowl of water for the seals, compose the gyozas scopping a spoon in each shell, applying some water around the edges and closing it.\n\nprepared boiling water. heat a pan and coat with some sesame oil.\nadd gyozas, add hot water until half covered and close with a lid. cook for 4-5 minutes (or until all water evaporated), remove the lid, drizzle with some more sesame oil and cook for 2 more minutes.\n","ingredients":["100g cabbage","50g onion","50g chives","120g pork mince","3 cloves garlic","1 inch piece ginger","1/2 spn soysauce","1/2 spn sugar","pepper pepper pepper","1 spn sake","1/2 spn sesame oil","1 spn potato starch","1/2 spn oyster sauce","25 Gyoza Wrappers","Flour for dusting"],"notes":"I had no idea how garlic chives tasted like and had none at hand so tried replacing with leek. Don't to this. Leek is quite out of place in this recipe tbh. I still have no idea what to use instead of chives, PR welcome lol.\n\nThe pre-made frozen gyoza wrapes are super convenient and I think you can find them in any asian supermarket. Look out for the last 2-3 at the bottom of the pack that tend to stick together once you get them out of the freezer.\n\noyster sauce can be replaced with worchestershire sauce\n"},{"title":"low-fi chicken","section":"meat","tags":["meat"],"description":"For when I planned to make karaage but then decided that I can't be bothered to fillet the chicken and wait for the marinade to settle.\n\nServes probably 2\n\n## ingredients\n\ncore:\n- 4-5 chicken thighs\n- pepper pepper pepper\n- salt\n- 1 spn vegetable oil\n\nnot-karaage plugin:\n- 1 spn soy sauce\n- 1 spn sake\n- 1 coffespn sesame oil\n- 2 garlic cloves\n- some ginger (equivalent in ginger of 2 garlic cloves)\n","preparation":"- [plugin-only step] chop or grate ginger and garlic \n- mix with all other ingredients in a bowl as if preparing a marinade\n- [plugin-only step] stop thinking if you should actually go one step further, wait for the marinade and prepare karaage instead\n- [plugin-only step] realize that it's not de-bone o'clock\n- [plugin-only step] give up\n- preheat oven, upper grill settings at 200C (or set to broil if your oven has a broiler)\n- place chicken on a grill so that juice drips and can be collected in a tray\n- cook ~20 min, midway through flip it and try to ladle the juices collected in the tray over it again\n","ingredients":["TODO"],"notes":"This actually sounds reasonably not low-fi because of the not-karaage plugin but point is: you can go as low-fi as just some salt, pepper and oil and add whatever spice you like/have available in your kitchen.\n\nJust make sure that you broil the chicken istead of throwing it into the over with default settings (like, tray ad mid-height with both grills ventilated) or it will take ages to cook and won't be much crispy.\n"},{"title":"equinox alter","section":"drinks","tags":["drinks"],"description":"a variant on the equinox as described on reyka vodka's website\n","preparation":"wash a coupe or martini glass with orange bitters and leave to freeze briefly.\nstir vodka, vermouth, lillet, tabasco with ice\ndouble strain\n","ingredients":["60ml reyka vodka","10ml dry vermouth","15ml lillet blanc","3 dashes tabasco","orange bitters"],"notes":"first try was with 15ml vermouth but decided it was too much. experiment, adjust and pr as needed.\n\nsuggestion: tabasco-salt rim on half of the glass\n"},{"title":"ppajeori","section":"other","tags":["other"],"description":"ppajeori is a spring onion salad that simply cannot be missed in a korean bbq.\n","preparation":"shred the spring onion in thin strips. using a specific tool (ネギカッター) is recommended.\notherwise a good way of doing that is to halve the spring onion lengthwise, fold it over and julienne the folded pieces.\nway easier than cutting long strips with a knife.\n\nmix the rest of ingredients together in a separate bowl and use them as dressing on the green onions just before serving.\n","ingredients":["6 spring onions","1spn gochugaru","1spn sugar","1spn soy sauce",".5spn fish sauce","1spn rice vinegar","1spn sesame oil"],"notes":"says 6 spring onions but the same amount of dressing can likely scale in the range of 5-9 depending on how big your spring onions are and how much dressing you like to use."},{"title":"randomest curry","section":"meat","tags":["meat"],"description":"My curry is the randomest thing. I think I tried to look up a convincing recipe and then mixing 3 or 4 together. But the result is reasonably good.\n\nServes: 1 for an entire week, you do the math.\n\nTODO (ingredients) I'm sure I'm missing something here. also, qualify \"that dodgy stock thing\".\n","preparation":"- chop onion\n- throw in pot with oil on mid-high and fry it for a min until lightly golden\n- roll a beef die\n- if the result is 20, spend a minute questioning geometry, the skill of the butcher who cut your meat in icosahedral shape and why would that even have numbers on the sides.\n- roll all beef dice in the pot\n- no, you can't use a special ability to reroll the 1s and 2s. not even if you're Mandy Thompson. those armor rolls are failed, move on and focus on not burning the curry\n- cook for a couple of minutes to brown the exterior, stirring constantly to prevent sticking\n- add water, tomato, \"that dodgy stock thing\", yogurt, curry powder\n- leave on high heath until it starts boiling then turn down on low\n- it will take 2~3h to reduce and thicken, stir occasionally\n- at some point you will inevitably lose patience and decide to add cornflour to help it getting to the right consistency before your driving license expires\n- do some guesswork to figure if it looks ready or not\n- get impatient and decide that it's indeed ready\n- serve\n","ingredients":["1 can of tomatoes","water","(how much? 20b6? ) diced beef","vegetable oil","a pack of \"that dodgy stock thing\"","white yogurt","1 onion or 2","curry powder (I usually use rogan josh but whichever is your fav)","1 spn corn flour or 2"],"notes":"Goes great with some udon.\n"},{"title":"creamy mushroom tortelloni","section":"pasta","tags":["pasta"],"description":"This recipe has a very decent ROI on time invested x result.\n\nServes 2.\n","preparation":"- chop garlic fine\n- remove stem from mushrooms and slice them\n- set pot of water on high heat to boil\n- set pan at mid heat and melt butter\n- add garlic, mushrooms, parseley and a sprinkle of pepper\n- cook until browned (mushrooms will first absorb all the butter then release some juices -- at that point they're pretty much done)\n- deglaze pan with a gulp of bourbon\n- add cream and set heat to low\n- sprinkle some extra pepper for maximum pepper freshness\n- stir frequently making sure that the cream doesn't stick, cook for ~2-3 mins, just enough to have the cream thicken a little\n- when water boils, drop some coarse salt and tortelloni in the pot\n- follow instructions on tortelloni pack for how long it takes to cook, stir occasionally\n- drain tortelloni, put in a bowl, pour sauce over them and mix well\n- profit!\n","ingredients":["250g tortelloni","coarse salt","2 garlic cloves","a cube of butter (~10g)","150ml double cream","100g chestnut mushrooms","1 spn parsley","pepper pepper pepper","bourbon"],"notes":"Do not, under any circumstances, add the tortelloni in the water before it's boiling.\n\nMy go-to tortelloni are the chorizo-filled you can find in uk's tescos but use whichever filling you like the most. Or tortellini. Or cappelletti. or whatever you feel like.\n\nIf your pan is big enough, you can pour the drained tortelloni in the pan with sauce and give them a stir while still on low heat instead of using a bowl. Not sure it makes much difference but feels fancier.\n\nI specified 1 spn parsley assuming that you have some kind of dried parsley but if you have it fresh use that, it's way better.\n"},{"title":"doubanjang rib glaze","section":"sauce","tags":["sauce"],"description":"this stuff is addictive. do not serve without some bready thing to soak up the sauce or you'll face eternal regret.\n","preparation":"mix everything.\n\nuse on ribs. recommended cooking: 180C 20m meaty side down, flip, 5m, flip, 5m\n","ingredients":["4.5spn doubanjang","3spn honey","1spn maltose","3spn soy sauce","3spn dark soy sauce","2spn chinkiang vinegar","5 garlic cloves"],"notes":""},{"title":"sake martini","section":"drinks","tags":["drinks"],"description":"","preparation":"stirred with ice, strain in coupette.\n","ingredients":["50ml vodka","15ml sake","3 drops black pepper tincture"],"notes":"adjust ratios based on sake used, I guess.\n"},{"title":"bruschetta","section":"other","tags":["other"],"description":"quick, garlicky, refreshing.\n\nmakes 12 bruschette (that feeds 2 bruschetta fans or up to 6 people if it's for a snack)\n","preparation":"preheat oven at 160C top grill + fan assisted. slice bread ~1.5cm thick. dice tomatoes in ~.5cm pieces.\n\ngrill bread slices in almost-top rack of the oven for 4m, flip, repeat for 3m. rub garlic on bread (should be crispy and consume the garlic as you rub it as if it was chalk on a rock). drizzle generously with oil. top with tomato, oregano, salt, pepper, more more quick oil drizzle on top of tomato.\n\ngrill in oven for 3m (tomato should start drying on the edges and not be too moist anymore, leave 1 more minute if not). top with basil leaves and flaky salt and serve.\n","ingredients":["loaf of bread (something ciabatta-like, or a big sourdough)","2 heritage tomatoes","4 garlic cloves","6 sprigs fresh oregano","2 sprigs fresh basil","olive oil","salt","pepper","flaky salt"],"notes":"![alt text](https://github.com/caligin/actual-cookbook/blob/master/img/bruschetta.jpg \"made 6 at first, then 6 more because it was too good not to!\")\n"},{"title":"panna cotta","section":"sweets","tags":["sweets"],"description":"TODO reference https://www.epicurious.com/recipes/food/views/panna-cotta-14224\n\nconversion from cups:\n- 480g heavy cream cream\n- 240g half half\n- 67g sugar\n\nreality of what I tried:\n- 230g double cream\n- 120g whole milk\n- 33g sugar\n- 1 pack of powder gelatin diluted in 8spn and then used half of the mix\n- too much vanilla because I spilled lol\n","preparation":"","ingredients":["TODO"],"notes":""},{"title":"okonomi sauce","section":"sauce","tags":["sauce"],"description":"","preparation":"just mix everything together and adjust amounts to taste!\n","ingredients":["4spn ketchup","2spn oyster sauce",".5spn worchestershire sauce",".5spn sugar","2spn soysauce"],"notes":""},{"title":"chasfoo","section":"meat","tags":["meat"],"description":"Made hirata buns but forgot to prepare some char siu marinade beforehand. Also, a japanese-style chashu is kinda different from a chinese char siu one (btw am I spelling any of this actually correctly??). Plus, I got the wrong cut of pork that doesn't go well in an oven. So with all of this and no time to look up a proper recipe I just improvised with the idea of punping up some sugar content so it goes well pan-fried and this combo turned out to be very successful.\n","preparation":"- mix everything (except the pork)\n- cut the pork in thin slices\n- add the marinade, give it a good massage\n- rest in the fridge for at least 10 minutes\n- pan fry until the marinade is clearly forming a glaze and becomes sticky and crispy\n","ingredients":["2 thin pork loins","2 spn honey","1 spn soy sauce","1 cpsn sake","1 cpsn sriracha","1 cpsn sesame oil","1 cpsn sugar syrup","1 cpsn miso"],"notes":"Perfectly fine to use the same marinade for pork belly slices cooked in the oven. Might be better with some added starch in that case.\n\nPerfect filling for [hirata buns](https://github.com/caligin/actual-cookbook/tree/master/other/hirata-buns.md) in combination with some [buttersoy mushrooms](https://github.com/caligin/actual-cookbook/tree/master/other/buttersoy-mushrooms.md).\n"},{"title":"bbq-glaze","section":"sauce","tags":["sauce"],"description":"adapted from BA's [Bourbon and Brown Sugar Barbecue Sauce](https://www.bonappetit.com/recipe/bourbon-and-brown-sugar-barbecue-sauce)\n\nmaltose is evil but *non negotiable*, don't think that any sub would give the same stickiness.\n","preparation":"crush dried chillies, mix everything else in a pan and heat over medium to simmer and reduce.\n","ingredients":["200ml ketchup","60ml smoky whisky","3spn brown sugar","3spn maltose","3spn rice vinegar","2spn worchestershire sauce","1spn soy sauce","1spn mustard","2 garlic cloves","2 dried red chillies",".5spn black pepper"],"notes":"smoky whisky can be replaced with bourbon/mild rye plus 1spn smoked salt. sounds like a rather random ingredient,\nbut I have some for no good reason and had some horrid sazerac rye that I needed to use in something that isn't a drink and worked just fine.\n\nthis keeps for a while."},{"title":"scofflaw","section":"drinks","tags":["drinks"],"description":"","preparation":"shaken with ice, double strain in coupette.\n","ingredients":["45ml scotch","45ml dry vermouth","15ml lemon juice","7.5ml grenadine","1dash orange bitters"],"notes":"original recipe called for bourbon\n"},{"title":"manhattan","section":"drinks","tags":["drinks"],"description":"","preparation":"add everything in a mixing glass with ice and stir to chill and dilure. strain in coupe glasses.\n","ingredients":["50ml blended scotch","30ml sweet vermouth","2dash angostura bitters"],"notes":"also called a rob roy because I do it with scotch, I hear.\n"},{"title":"el chapo","section":"drinks","tags":["drinks"],"description":"aka the mexican penicillin. recipe taken from the Bonneville Collection (idk which video it was, search for it on yt)\n","preparation":"mix reposado, lime juice, syrups in shaker with ice. double strain in rocks glasses with big ice chunk. float mezcal on top\n","ingredients":["40ml reposado tequila","20ml lime juice","10ml ginger syrup","10ml agave syrup","1 cspn mezcal"],"notes":"if you don't have mezcal a smoky schotch is still alright\n"},{"title":"clams linguine","section":"pasta","tags":["pasta"],"description":"recipe taken from [BA's Best Linguine and Clams](https://www.bonappetit.com/recipe/best-linguine-and-clams)\n","preparation":"scrub clams then leave them in a bowl with salty water for at least 30m to purge.\n\nheat up 2spn olive oil in a duch oven over medium, add 3 garlic cloves chopped fine and breadcrumbs and brown until crisp, stirring often. remove from pan and add flaky salt and lemon zest. wipe the dutch oven.\n\nheat remaining oil in a duch oven over medium, cook sliced garlic until golden at edges. add anchovies and red pepperflakes and cook until golden and anchovy is dissolved. add wine and simmer until reduced to a couple of spoons. add clams and toss to coat. cover and cook until clams are open, about 5 minutes (check & cook more if not open yet). transfer clams in a bowl leaving sauce in the dutch, cover with foil.\n\ncook pasta halfway through, then transfer 240ml pasta water and pasta to dutch oven with sauce. cook until pasta is al dente and sauce looks glossy and thick.\n\nremove from heat. add parsley, butter and a third of breadcrumbs and toss to melt butter. plate and top with clams, more breadcrumb mixture, more pepper/salt and a drizzle of oil.\n","ingredients":["3 garlic cloves, chopped","9 garlic cloves, sliced","120g breadcrumbs","2spn olive oil","60ml olive oil","1spn lemon zest","100g parsley","2spn unsalted butter","80ml dry white wine","1/4spn crushed red pepper flakes","2 anchovy fillets","180g linguine","1kg clams","flaky salt"],"notes":"I actually used pappardelle instead of linguine. I really like how they absorb the sauce tbh.\n\namout of breadcrums and parsley is very approximative, I go by eye. similar for clams: I asked \"enough for a meal for 3\" to the fishmonger and went with what he gave me. might have been 1kg, not really sure (the above amounts refer to a meal for 2 though).\n\n![alt text](https://github.com/caligin/actual-cookbook/blob/master/img/clam-linguine.jpg \"version with pappardelle\")\n"},{"title":"spiced lamb chops","section":"meat","tags":["meat"],"description":"from [Mint and Cumin-Spiced Lamb Chops](https://www.bonappetit.com/recipe/mint-cumin-spiced-lamb-chops)\n","preparation":"","ingredients":["TODO"],"notes":""},{"title":"hotsweet ribs glaze","section":"sauce","tags":["sauce"],"description":"I think I improvised this? was probably some BA recipe on which I had to make some swaps b/c missing ingredients\n","preparation":"mix everything\n","ingredients":["60ml soy sauce","2spn maple syrup","1spn corn starch","1spn siracha","1spn rice vinegar","1/4spn 5spice powder","1/4spn pepper flakes","1/4spn garlic powder","1/4spn ginger"],"notes":"use on ribs\n"},{"title":"glossy ribs","section":"meat","tags":["meat"],"description":"source: https://www.bonappetit.com/story/riblets-better-than-wings\n\nTODO refine, this is a quick reference in ml instead of us units\n","preparation":"todo --  but the tl;dr is use salt to season ribs, mix everything else, coat and marinade for 1h\n","ingredients":["1.4kg baby back ribs","120ml rice vinegar","3spn worchestershire sauce","240ml maple syrup","180ml dijon mustard","160ml gochujang","flake salt"],"notes":"recipe calls for chopping the ribs in halves but if you don't I used a quarted of the amounts for 700g ribs and that was plenty \n"},{"title":"samgyeopsal gochuchang","section":"sauce","tags":["sauce"],"description":"","preparation":"mix everything, apply as marinade to pork preferably overnight\n","ingredients":["2spn gochuchang",".5spn sugar","1spn rice vinegar"],"notes":""},{"title":"shrimp and basil stir fry","section":"fish","tags":["fish"],"description":"from: [Shrimp and Basil Stir-Fry](https://www.bonappetit.com/recipe/shrimp-and-basil-stir-fry)\n\nGoes brilliantly as an appetizer for 2-3 people\n","preparation":"chop chillies in smaller chunks, peel and crush garlic, devein (but peel only at your discretion) shrimps and remove their legs.\n\npestle (or mix in a food processor if you prefer) chillies, garlic, sugar, fish sauce, salt, vegetable oil to form a sauce.\n\ncoat prawns and leave to marinade for at least 15 minutes.\n\npan-fry shrimps to sear on both sides (2 minutes per side on high if shells are on) leaving marinade aside. remove from heat and toss in basil until wilts.\n\nserve with lime wedges\n","ingredients":["3 chillies","6 garlic cloves","60ml sugar","2spn fish sauce","1spn salt","4spn vegetable oil","6-8 large shrimps","basil leaves","lime wedges"],"notes":"you can add in the extra marinade just for the last minute of cooking if you really want but adding too early will caramellize excessively.\n"},{"title":"aftermash cookies","section":"sweets","tags":["sweets"],"description":"I wanted to find a way to recycle the spent grains from mashing for beer and the first idea I found was to make cookies. I found a recipe but I didn't have half of the ingredients so I just threw in a bowl random amounts of everything.\n\nShoud get approx 10 cookies out of this\n\n## tools\n\n- oven\n- baking tray (or normal tray with baking paper)\n","preparation":"- preheat oven at 200c\n- melt butter\n- throw everything in a bowl except lemon and butter\n- zest the lemon peel\n- add the butter while still hot, then mix and modl on a baking tray while still warm\n- bake 20m  \n","ingredients":["200g spent grains from mashing","~100ml milk","~200g flour","~50g butter","1 lemon","1 handful of raisins","1spn honey","1spn maple syrup","~50g sugar"],"notes":"All amounts are indicative and probably not representative of reality. Just throw how much you feel like, you're probably still looking after your boil at this point and dedicating too much attention to amounts for cookies is gonna distract you from caring for your hops instead.\n"},{"title":"creamy garlic chicken","section":"meat","tags":["meat"],"description":"From [How To Make Creamy Garlic Chicken | Chicken With Creamy Garlic Sauce | Easy Chicken Recipe in 20 Min](https://youtu.be/pbp8wFU1gq0).\n\nCan't say no to something loaded with garlic.\n","preparation":"- sprinkle salt, pepper pepper pepper and paprika on the chicken\n- heat up half the olive oil in a pan and add chicken skin side down\n- when looks golden flip once, then remove and set aside\n- throw away the chicken fat from the pan\n- heat half the olive oil\n- fry garlic cloves until golden\n- add chicken again, skin side up\n- add broth, wine, yogurt and double cream\n- reduce\n- sprinkle parsley\n","ingredients":["~4 chicken thighs","pepper pepper pepper","salt","paprika","2spn olive oil","15 garlic cloves","chicken broth","white wine","yogurt","double cream","parsley"],"notes":"Chicken broth can be replaced by water if you don't have it.\n\nBe careful not to add too much liquid for the sauce or you'll be waiting for it to reduce for three or four lifetimes.\n\nBe careful when to add yogurt and cream to pour around the chicken and not on top or it will probably get stuck there and you want to keep the skin side up.\n"},{"title":"tricky takoyaki","section":"other","tags":["other"],"description":"From: [Cooking with Dog - Takoyaki and Ebiyaki Recipe](https://cookingwithdog.com/recipe/takoyaki-ebiyaki/)\n\nWith my cast iron pan and electric hobs these little bastards are tricky af to make. but well, the deliciousness kinda pays off.\n","preparation":"TODO\n","ingredients":["TODO"],"notes":"using the granulated dashi from japan center 1 portion is too much for 350ml water. it's so strong it overpowers everything. go for 1:700ml and it should be alright.\n\nthe pan needs to be very greasy beforehand, well preheated and kept at a steady mid-temperature (5/10 on my electric hobs).\n\nstill, needs loads of patience.\n\nI can't stress enough how important it is to grease the pan well beforehand, if it's even a little dry the little bastards will self-destruct as you try to flip them.\n"},{"title":"lumpia","section":"other","tags":["other"],"description":"TODO: https://tasty.co/recipe/vegetable-and-shrimp-lumpia\n","preparation":"","ingredients":["TODO"],"notes":""},{"title":"american style pancakes","section":"sweets","tags":["sweets"],"description":"Basic pancake recipe, perfect for those lazy sunday mornings. Adapted from [bbc good food recipe](https://www.bbc.co.uk/food/recipes/fluffyamericanpancak_74828).\n\n ### Optional toppings\n\n- Strawberries\n- Blueberries\n- Maple syrup \n- Streaky bacon (fried until cripsy)\n- Vanilla greek yogurt\n","preparation":"Melt butter on low heat.\n\nPrep any toppings e.g. wash and cut fruit, fry bacon\n\nSift the flour, baking powder, salt and caster sugar into a large bowl.\n \nIn a separate bowl lightly whisk together the milk and egg, then whisk in the butter.\n\nPour the wet mixture into the flour mixture and, using a whisk, beat until you have a smooth batter. Let the batter stand for a few minutes.\n\nHeat a non-stick frying pan over a medium/low heat and add a few drops of rice bran oil. Add a small ladle of batter. Wait until the top of the pancake begins to bubble, then turn it over and cook until both sides are golden brown.\n\nTop with ingredients of choice and best served warm with lashings of maple syrup.\n\n![alt text](https://github.com/caligin/actual-cookbook/blob/master/img/pancake.jpg)  \n","ingredients":["135g plain flour","1 tsp baking powder","½ tsp salt","2 tbsp brown caster sugar","130ml whole milk","1 large egg, lightly beaten","2 tbsp melted butter (allowed to cool slightly)","Rice bran oil for cooking"],"notes":""},{"title":"cheatcode curry","section":"meat","tags":["meat"],"description":"I once prepared curry boiling the beef that goes in for, like, 5 hours. using the sb golden curry thing takes, like, 5 minutes. now tell me if that's not cheating.\n\nfeeds you for at least two meals\n","preparation":"- melt butter in a pot\n- throw potato, onion and meat in it and cook them a little\n- add carrot and cook everything a little more, stirring frequently\n- add water\n- heat up to a boil\n- set to low, cover and simmer for 15\n- remove from heat\n- add the curry bricks and stir continously until uniform\n- feel guilty for how trivial this is with the ~~cheat code~~ curry bricks\n- serve\n","ingredients":["4 smallbricks of sb golden curry","0.7l water","250g diced chicken (or your meat of choice)","loads of butter","2 carrots","2 baby potatoes","1 onion"],"notes":"you'll need something on the side to pick up the sauce. some toasted bread works just fine.\n"},{"title":"casino","section":"drinks","tags":["drinks"],"description":"from totr [5 EASY GIN COCKTAIL RECIPES!](https://youtu.be/u-fzCODNVUw)\n","preparation":"shake all except cherry. double strain, garnish with cherry\n","ingredients":["60ml gin","15ml maraschino","22.5ml lemon juice","7.5ml simple syrup","3 dashes orange bitters","maraschino cherry"],"notes":""},{"title":"baozi dough","section":"other","tags":["other"],"description":"from [包子 几个蒸包子的诀窍 失败是一件很困难的事情](https://youtu.be/M6DD504lDac), this is half the original recipe.\n\nmakes 24 buns.\n","preparation":"dissolve yeast in warm water, add flour, knead to make it come together. rest for 30m covered. knead some more, then rest covered for 1.5h.\n\npunch air out, give a little knead to remove all air bubbles, make a donught shape then cut in \n","ingredients":["450g warm water","4g instant yeast","750g all purpose flour"],"notes":""},{"title":"lamb and shrimp baozi filling","section":"other","tags":["other"],"description":"from [包子 几个蒸包子的诀窍 失败是一件很困难的事情](https://youtu.be/M6DD504lDac), this is half the original recipe\n\nserves 2\n","preparation":"mix shrimp with white pepper and soy sauce, leave aside to marinade.\n\nchop lamb to a paste-ish, add half shrimp and finish chopping to a paste.\n\nadd to a bowl, add the rest of ingredients, stir with a whisk maintaining a single direction. when it's uniform, add the rest of shrimp and keep mixing to break it down.\n","ingredients":["200g shrimp","125g lamb leg","7.5g soy sauce",".5g white pepper","25g whie part of green onion","3g ginger paste","4g salt","1g 5spice powder","1g sichuan peppercorn","1/2 egg white","2g sesame oil"],"notes":"the \"mixing in one direction\" part is actually important because proteins alignment, if you don't do it the meat doesn't stick together\n"},{"title":"buckwheat galettes","section":"other","tags":["other"],"description":"\nBatter for the buckwheat galettes comes together super quick and easy, makes approximately 10+ galettes and batter keeps overnight.  Fill with whatever tickles your fancy but a few personal favorites:\n\n- ham, egg, gruyere\n- spinach sauteed with sliced garlic, egg, gruyere\n- mushrooms sauteed with sliced garlic and herbs, egg, gruyere\n","preparation":"Mix the flour, egg, water and salt together with a whisk and leave batter for 2 hours or overnight in the fridge (optional). \n\nHeat a flat, non-stick pan (4 on our electric hob) and coat with a thin layer of olive oil.\n\nAdd full ladle of the batter to pan and swirl the pan so that the batter covers the entire base of the pan in a thin and even layer. You should see bubbles forming immediately when the batter hits the pan and the galette should take on a lacy pattern. It's normal for the first galette to come out thick and un-usable. \n\nCrack a whole egg in the middle of the galette and spread the egg whites with a palette/dinner knife - this is to help the whites cook evenly. Hold the egg yolk in position with the knife (take care to not pop the yolk!) while adding some grated cheese along on side of the yolk - this will keep the yolk from sliding all over the place and you will end up with a prettier end result. Distribute more cheese around the galette and then add your sauteed veg or filling of choice. \n\nSeason the galette with salt and pepper before folding the edges of the galette with a spatula to form a square - leave the yolk and some toppings around the yolk exposed. Cover for 1 minute to let the cheese melt and then serve.\n\n![alt text](https://github.com/caligin/actual-cookbook/blob/master/img/buckwheat-galette.jpg \"buckwheat galette\")\n","ingredients":["330g buckwheat flour","1 large egg","750ml water","pinch of salt"],"notes":""},{"title":"pizza dough","section":"other","tags":["other"],"description":"makes 2 pizzas\n","preparation":"dissolve yeast in water, dissolve 10% of flour as a \"buffer\" for salt. dissolve salt, add rest of flour and evoo.\n\nrise 2h covered at room temp. cut in 2, proof for 12-24h in the fridge. leave 1h outside the fridge before using.\n","ingredients":["500g 00 flour","350ml warm water","1g instant yeast","15g salt","2 spn evoo"],"notes":"if nothing rises your yeast is deeeeeeeeeeeeeeeeeeeeead\n"},{"title":"pelmeni","section":"other","tags":["other"],"description":"From: [How to make Russian pelmeni - Cooking with Boris](https://youtu.be/YO7AdLsUSec)\n\nBasically small chebureki. And not deep fried.\n\nServes: me 4 or 5 times\n","preparation":"### filling\n\n- chop the onion coarsely\n- mince garlic\n- combine mince, chopped onion, 1cspn salt, pepper in a bowl\n- mix with your hands\n- cover and let sit while you prepare the shells\n\n### shells\n\n- combine flour, 1cspn salt, egg, water in a bowl\n- mix to form dough\n- knead until it's uniform enough\n- use a rolling pin to flatten, then some with a round mold like a glass to cut circular shapes out of the flattened dough\n\n### kombine\n\n- get a pot of water with some salt to a boil\n- put a spoonful of filling in middle of a shell and fold, then use press on the edges to seal the pelmen and fold the edges inwards\n- boil in batches for 7m\n- serve with some fresh dill (if you have it) and plenty of mayonez\n","ingredients":["250g *pork* mince","1 garlic clove","1/2 onion","2 1cspn salt","1spn pepper","1 egg","200ml water","300g flour"],"notes":"Works better with pork mince or a mix that is mainly pork. Actually, don't even try to use beef, it's not great and does not go that well with either the seasonings nor mayonez.\n\nWell suited to last long in the freezer and serve as emergency rations.\n"},{"title":"asian lady","section":"drinks","tags":["drinks"],"description":"a take on white lady\n","preparation":"juice lime. reverse dry shake egg white. (combine all ingredients except egg white in shaker with ice, shake to chill, discard ice, add egg white to mixture, shake to foam).\ndouble strain in coupe glass.\n","ingredients":["60ml london dry gin","5ml ginger syrup","5ml cointreau","5ml simple syrup","10ml lillet blanc","1 lime","1 egg white"],"notes":"first experiment was without simple syrup and it was lacking some sweetness and hypotesis is that the syrup will fix it. experiment and PR as needed.\n"},{"title":"piadina","section":"other","tags":["other"],"description":"makes 6 small piadinas. feeds 2.\n","preparation":"mix flour and baking soda, make a well in the middle, add all wet ingredients in it and knead until smooth. you'll prob need to adjust and add more water but you need at least 60ml for sure.\n","ingredients":["165g 00 flour","25g evoo","1/2spn baking powder","60ml warm water","more warm water"],"notes":"use a stand mixer if you can. making a well is still recommended.\n"},{"title":"el presidente","section":"drinks","tags":["drinks"],"description":"from [Rum Cocktails VOL I](https://www.youtube.com/watch?v=LTWmgkp8aIM)\n","preparation":"mix in a shaker with ice. double strain in a coupette glass. garnish with orange zest.\n","ingredients":["5ml grenadine","10ml triple sec","20ml dry vermouth","50ml light rum"],"notes":""},{"title":"vodka","section":"drinks","tags":["drinks"],"description":"","preparation":"- open vodka bottle\n- pour in glass\n- drink\n","ingredients":["vodka bottle. russian standard works well."],"notes":"works best when freezer cold.\n\n\n\n*what else did you expect?*\n"},{"title":"coffee liqueur","section":"drinks","tags":["drinks"],"description":"as seen on [cocktail chemistry](https://youtu.be/JjW8-sBejm0), noted down here for quick access.\n","preparation":"add ground coffee and 300ml water in a mason jar. shake and store in fridge overnight (this makes the cold brew).\nbring 240ml of water to a simmer, dissolve brown sugar in it (this makes the sugar syrup).\nstrain cold coffee brew in a bottle, then add sugar syrup, vanilla extract and rum and shake.\n","ingredients":["40g ground espresso coffee","540ml water","500ml dark rum","200g dark brown sugar","1 spn vanilla extract"],"notes":"first run of recipe used light brown sugar and 20g ground coffee. result is delicious but light in colour and a bit lacking on the coffee character. hypotesis is that 40g coffee for the cold brew and using dark brown sugar would give it the missing touches. experimet and pr as necessary.\n\nI love using a [gordon street's black forest roast](https://www.gordonstcoffee.co.uk/product/black-forest-roast/) for this. for reference first run of recipe used a havana 7 as base rum.\n"},{"title":"amazake pancakes","section":"sweets","tags":["sweets"],"description":"TODO, reference: https://cookpad.com/us/recipes/157968-amazake-pancakes\n\nbutter instead of oil to grease the pan is fine\n","preparation":"","ingredients":null,"notes":""},{"title":"ikayaki-korean-style","section":"sauce","tags":["sauce"],"description":"baby squid on a stick is simply glorious, and coating it in red angry korean sauce makes it even more delicious.\n","preparation":"mix all ingredients, use a brush to apply to ikayaki and cook until caramelised. can brush more layers on top of an already caramelised one.\n","ingredients":["2spn gochujang","2spn gochugaru","1 garlic clove","1spn soy sauce","1spn mirin","1spn sake","2spn honey","1spn sesame oil","1spn sesame seeds"],"notes":""},{"title":"miss-kinesis","section":"drinks","tags":["drinks"],"description":"a \"kina\" take on a white lady.\n","preparation":"dry shake everything except bitters. garnish with bitters drops on the foam.\n","ingredients":["45ml london dry gin","22.5ml lime juice","22.5ml kina l'areo d'or","15ml simple syrup","1 egg white","orange bitters"],"notes":"a \"stronger\" gin is preferrable, like boatyard double gin."},{"title":"juicy karaage number one","section":"meat","tags":["meat"],"description":"From [Double Fried Chicken Karaage Recipe (Crispy and Juicy Japanese Fried Chicken) | Cooking with Dog](https://youtu.be/CEX_rCVTPKE) and/or [Japanese fried chicken recipe - Tori no karaage - 鳥のから揚げ](https://youtu.be/SFInCMz0goQ).\n\nKaraage is just delicious.\n\nNot sure how many it serves, I use it as a side/snack to share.\n","preparation":"- poke holes in chicken for maximum marinade, then cut in bite-size pieces (~3 per thigh)\n- place chicken in bowl with garlic, ginger, sake, sesame oil, soy, salt and pepper\n- give it a massage to even the marinade and leave in fridge for at least an hour\n- add corn flour in the bowl and mix\n- heat up oil at medium heat (~140C) and fry chicken for ~3-4 min\n- up the heat to high (~170C) and fry them again for ~1 min\n- dry and serve\n","ingredients":["300g boneless chicken thigh","1 spn soy sauce","1 spn sake","1 coffeespn sesame oil","salt","pepper pepper pepper","1 coffeespn grated ginger","1 coffeespn grated garlic","2½ spn corn flour/corn starch (whichever you call it)","vegetable oil"],"notes":"Get a way to check the oil temperature like a digital termomether or something, I lost count of times I had it too high and dried out the chicken.\n\nyou can optionally add a little beaten egg with starch for the coating but tbh it's better w/o\n\nIf you can't find boneless thighs with the skin on get thighs with bone and debone them yourself. It's annoying but [Chef Dai has a cool tutorial on how to cut that bone away more efficiently](https://youtu.be/r0IEiU_-Fjo). I don;t recommend giving up on the skin.\n"},{"title":"char siu marinade","section":"sauce","tags":["sauce"],"description":"From [CHAR SIU RECIPE - MELT IN YOUR MOUTH CHINESE BBQ PORK](https://youtu.be/c0ICMcuhdPg).\n\nSee the char siu recipe in the meat section, here's just the sauce.\n\nI couldn't find all the necessary ingredients easily and couln't be asked to go all the way to Chinatown to find them so the ingredients listing includes my replacements.\n\nEnough for: cooking a round of char siu of about ~500g plus some leftover to brush on burgers\n","preparation":"- mix everything together\n","ingredients":["4 spn honey","2 spn light soy sauce","1 spn mirin","1 spn loganma crispy chilli oil","1 spn oyster sauce","1 spn hoisin sauce","1/2 coffeespn five spices","2 tsp of dark soy sauce","1 spn some random indian paprika I found in the cupboard"],"notes":"Refer to the linked video for the original recipe, I used the crispy chilli oil instead of the garlic chili sauce and the random paprika instead of the color options that I forgot to buy.\n"},{"title":"mezcal substitute","section":"drinks","tags":["drinks"],"description":"discovered by mistake experimenting, this combination is similar enough to a mezcal that I would't be offended by having it as a replacement in a cocktail.\n","preparation":"mix.\n","ingredients":["10ml smoky whisky","10ml vodka","10ml tequila reposado"],"notes":"ingredients given as 10ml but this scales 1:1:1 so whatever your target need of mezcal is /3.\n"},{"title":"beacon mule","section":"drinks","tags":["drinks"],"description":"original from [nerdswithknives](https://www.nerdswithknives.com/beacon-mule-bourbon-ginger-beer-cocktail/)\n\nserves 2\n","preparation":"shake whisky and lime with ice until cold. double strain in a tumbler glass and top with ginger beer. garnish with lime wedge or peel.\n","ingredients":["4 shots whisky","1 & 1/2 shot lime juice (~2 limes)","1 bottle of ginger beer"],"notes":"by \"1 bottle ginger beer\" I mean a 200ml fevertree one, that is just right to top up two servings.\n"},{"title":"crab linguine","section":"pasta","tags":["pasta"],"description":"recipe taken from [Linguine with Crab, Lemon, Chile, and Mint](https://www.bonappetit.com/recipe/linguine-with-crab-lemon-chile-and-mint)\n\nabsolutely delicious but crabslaying is a lot of work!\n","preparation":"TODO\n","ingredients":["TODO"],"notes":"taglierini (yes, taglierini not tagliolini!) is a fantastic replacement for linguine\n\na large british crab is perfect for a 2-people portion\n"},{"title":"tempura tech","section":"other","tags":["other"],"description":"From: [How to make Tempura - Sea bream tempura recipe - 鯛の天ぷら](https://youtu.be/EiHwtjNVyZE)\n","preparation":"TODO\n","ingredients":["TODO"],"notes":"The interesting part is not the recipe per se but the technique, that applies to pretty much anything you want to tempura (I can use tempura as a verb right?). \n\nI tried like 4 times and I keep buying the wrong type of fish. For some reason sea bream is impossible for my brain to recognize.\n\nIf you're in the uk you can find the tempura mix at a Sainsbury's with a big enough asian department, probably hiding next to the corn flour.\n"},{"title":"mushroom wok chicken","section":"meat","tags":["meat"],"description":"From [How to cook Chicken thighs with mushrooms](https://youtu.be/L9c6MLXWNew).\n","preparation":"TODO\n","ingredients":["TODO"],"notes":"Mushrooms, chicken, clean pan, vegs, chicken again, broth, mushrooms.\n\nMake sure to butterfly the chicken properly or it doesn't cook at all around the bone.\n"},{"title":"cheeki breeki chebureki","section":"other","tags":["other"],"description":"From: [Cheeki Breeki Chebureki (ЧЕБУРЕКИ) - Cooking with Boris](https://youtu.be/x9NEXPoepO4)\n\nNot for the faint of heart.\n\nServes: a small army\n","preparation":"### foundation\n\n- set aside one shot of vodka, that's for the cheburek shells. the rest is for the chef\n\n### filling\n\n- chop the onion coarsely\n- mince garlic\n- combine mince, chopped onion, 1cspn salt, pepper, dill, parsley in a bowl\n- mix with your hands\n- cover and let sit while you prepare the shells\n\n### shells\n\n- combine flour, 1cspn salt, sugar, egg, water, 1cspn oil, 1 shot vodka in a bowl\n- mix to form dough\n- knead until it's uniform enough\n- roll in a fat sausage, cut in 8 parts\n- use a rolling pin to flatten each piece to a circle/oval shape\n\n### kombine\n\n- heat a pan of oil or a deep frier, around 170c\n- divide the filling in 8 parts\n- put each portion in the middle of a shell and fold, then use a fork to press on the edges to seal the cheburek\n- deep fry until golden\n- serve with some fresh dill (if you have it) and plenty of mayonez\n","ingredients":["250g *pork* mince","1 garlic clove","1/2 onion","2 1cspn salt","1spn pepper","1cspn sunflower oil","1spn dill","1cspn parsley","1 egg","200ml water","300g flour","2 shots of vodka or 20","1spn sugar","sunflower oil for deep frying"],"notes":"Recipe works fine even if it's not middle of night or not cousin's place. And it works perfectly well with vegetable oil instead of sunflower.\n\nThere's no \"too big\" cheburek but having them bigget than the size of your pan doesn't help.\n\nWorks better with pork mince or a mix that is mainly pork. Actually, don't even try to use beef, it's not great and does not go that well with either the seasonings nor mayonez.\n\nIf you don't have a rolling pin, you can use a bottle of vodka instead. It also adds that \"nailed it\" flavour to the dish that you can't really with other means.\nJust be aware that if the vodka you have is a Русский Стандарт (as I would indeed recommend), its bottle shape just sucks at being a rolling pin: using one of those would make it double hard to prepare the shells and increase the \"nailed it\" flavours tenfold.\n\nWell suited to last long in the freezer and serve as emergency rations.\n\nCan easily be cooked in a deep fryer, set around 170c and fry for a few (5?) minutes-ish, until golden.\n"},{"title":"buttersoy mushrooms","section":"other","tags":["other"],"description":"from: [Sauteed Mushroom with Soy Butter Sauce - Japanese Cooking 101](https://youtu.be/XnCXAvhmRzI)\n\nthis. thing. is. so. simple. and. delicious.\n\nserves: hmmm idk depends on how much mushrooms you add? but it's a side so just go for how much you feel like\n","preparation":"- heat oil in pan\n- introduce mushrooms, saute for a couple of minutes until tender\n- add a chunk of butter and splash with soy sauce\n- sprinke wil salt and pepper\n- saute for a few more minutes until mushrooms start first to absrob the butter and soy and then getting lightly golden and crispy\n","ingredients":["some mushrooms","some soy sauce","some butter","salt","pepper","1spn vegetable oil"],"notes":"Original recipe calls for shiitake but any mushroom that is reasonably flavoursome would do.\n\nAmount of oil and minutes until tender will vary a lot depending on mushroom type, how much they absorb oil and how thick they're cut.\n\nPerfect filling for [hirata buns](https://github.com/caligin/actual-cookbook/tree/master/other/hirata-buns.md) in combination with some [chasfoo](https://github.com/caligin/actual-cookbook/tree/master/meat/chasfoo.md).\n"},{"title":"hk-style bbq chicken wings","section":"meat","tags":["meat"],"description":"we're trying hard to recreate a recipe, here are the ingredients that should go in it\n","preparation":"grate/crush/mince/pasteify ginger and garlic.\nthrow all ingredients in a bowl, give the meat a good toss and massage to spread the marinade evenly and let sit in the fridge for at least 30m, better overnight.\n\nthrow on a mid-high bbq. time depends on hotness of bbq, presence of lidding devices, thickness of wings, wind speed and weather forecast for the rest of the week...\nor but about 7 minutes per side.\n","ingredients":["8 chicken wings","ginger","garlic","chinese rose wine (玫瑰露酒)","white pepper","salt","soy sauce"],"notes":"no idea what the correct quantities are!\n\nif you (like us) can't find the rose wine, shaoxing wine works too although it's almost a whole different recipe with that substitution\n"},{"title":"clover club","section":"drinks","tags":["drinks"],"description":"from [Bonneville's recipe](https://youtu.be/qbZvgGRjzMo?t=56)\n","preparation":"mix all ingredients in a shaker without ice. long shake to foam (30-45s). add ice to shaker. shake to dilute and chill (20s). strain in a coupe glass.\n","ingredients":["50ml london dry gin","20ml lemon juice","20ml simple syrup","20ml egg white","6 raspberries"],"notes":"if you don't want to measure egg white (I don't), it's 1 egg white.\n"},{"title":"portobello gratin","section":"other","tags":["other"],"description":"massive mushrooms and cheese curls. what can possibly go wrong?\n","preparation":"crush/chop garlic\n\npreheat oven with grill at ~250\n\nmelt butter in a pan (griddle pan's even better) and cook mushrooms until butter absorbed and mushroom softened. flip as needed. move to baking tray with cap down, season with salt and pepper pepper pepper, fill with garlic, generous dose of grated gruvyere and top with thin layer of grated parmesan.\n\nthrow in oven and bake for ~2 minutes to melt and crisp cheese (keep an eye on it, it takes seconds to move from cripy to charcoal)\n","ingredients":["big portobello mushrooms","gruvyere cheese","parmesan","butter","garlic","salt","pepper pepper pepper"],"notes":"can replace gruvyere with whatever.\n\nnot sure that the trick with parmesan makes really a difference.\n\nI tested the recipe getting the oven part wrong so it was 200grill so the 250grill is hypotetical until proved right. 200 was not enough to make cheese crispy.\n"},{"title":"notcina","section":"pasta","tags":["pasta"],"description":"Ideally a norcina, but if all you can find is british breakfast sausage we're quite far from the desired result.\n\nServes 2.\n","preparation":"- chop onion fine\n- remove skin from sausages and shred in small pieces (it's probably easier with your hands than with a knife)\n- set pot of water on high heat to boil\n- set pan at mid heat and melt butter\n- add onion and fry for a minute or two until lightly golden\n- add sausage, a generous sprinkle of rosemary and a sprinkle of pepper\n- cook until browned\n- deglaze pan with a gulp of white wine\n- add cream and set heat to low\n- sprinkle some extra pepper for maximum pepper freshness\n- stir frequently making sure that the cream doesn't stick, cook for ~2-3 mins, just enough to have the cream thicken a little\n- when water boils, drop some coarse salt and penne in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, put in a bowl, pour sauce over it and mix well\n- serve\n","ingredients":["150g penne","100g firm sausage","150ml double cream","half an onion","1 coffeespn rosemary or 2","a cube of butter (~10g)","white wine","pepper pepper pepper","coarse salt"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nAfaik penne is the traditional type of pasta to use with this but any type would do. Fusilli work pretty well.\n\nSo, about the sausages. You ideally want something firm and savory with a decent amount of fat.  Unfortunately in the uk most if not all the sausages availabe at a supermarket is this british breakfast thing that is more similar to a pork paste. If you can find some decent sausages at your local buthcher then that's great, otherwise the closest thing I could get my hands on is the pork chipotlas from tesco's. They look the same as other sausages but are less liquid, that at least helps with shredding them.\n"},{"title":"smoky pineapple mezcal","section":"drinks","tags":["drinks"],"description":"I don't like pineapple but it's just perfect in this one.\n\nfrom [here](https://www.youtube.com/watch?v=LRk7kHKt3SA) with some edits\n","preparation":"add everything in a shaker with ice and shake to chill. strain in coupe glasses and garnish with pink peppercorn\n","ingredients":["30ml pineapple honey syrup","22ml pineapple juice","15ml lime juice","50ml mezcal","3drops chilli tincture"],"notes":"pineapple honey syrup is a 2:1 honey:water syrup, muddle pineapple and red peppercorns in it and steep overnigh then fine strain\n\nchilli tincture is an infusion of reposado tequila and dried chillies\n"},{"title":"har gow shells","section":"other","tags":["other"],"description":"recipe for the shells of har gow.\n\n## tools\n\n- cling film\n- large flat knife\n- oil\n","preparation":"- set aside ~17g wheat starch for later\n- mix the rest of wheat starch and potato starch\n- add boiling water, mix roughly with chopsticks\n- at this point there will be a lumpy pile of translucent chunks in the middle sorrounded by starch still powdery. this is correct, cover with some cling film and let rest 3 minutes\n- add rest of wheat starch and start kneading with your hands\n- knead for approx 5m+\n- roll in a fat sausage and cover to keep the moisture while you start forming the shells\n- to form a shell, grab a piece to form a ~2cm diameter ball, then flatten to a circle shape with the flat of your knife. oil knife (and maybe surface as well so it doesn't stick). then use the knife to scrape the shell from surface\n- fill with tasty things in the middle, fold and press with your fingers to seal. there's a specific traditional way of doing this but idk how to explain it tbh\n","ingredients":["100g wheat starch","17g potato starch","100ml boiling water"],"notes":"getting it right takes a lot of patience and flattening technique so if you can, buy these made.\n\nwhen I tried this I kneaded for only a couple of minutes: it had the right consistency when molding the shells, flavour and looks but the consistency didn't hold after cooking. I suspect that the main reason was not kneading enough so keep at it for at least food 5 min.\n\nalso, I forgot to add the starch in 2 rounds and had to add a little bit more afterwards, have no idea whether doing it right also makes the amount right too\n\nthis makes enough shells for a filling batch made from ~300g of shrimps\n"},{"title":"mezver","section":"drinks","tags":["drinks"],"description":"like a versper, but mezcal\n","preparation":"stir, garnish with grapefruit twist expressing oils\n","ingredients":["45ml vodka","30ml mezcal","15ml kina l'areo d'or"],"notes":"yes, unlike a vesper there's more vodka than base spirit - found out that it balances better like this with a mezcal that is more aromatic than smoky.\nthese ratios are with a wyborova vodka and dangerous don mezcal, using something smokier mezcal might need adjustment (or consider not doing this at all)."},{"title":"white lady","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients in a shaker without ice. long shake to foam (30-45s). add ice to shaker. shake to dilute and chill (20s). double strain in a coupe glass.\n","ingredients":["45ml london dry gin","22ml lemon juice","22ml triple sec","15ml simple syrup","22ml egg white"],"notes":"22ml egg white is about little less than a medium egg white. using a whole egg white (about 30ml) is totally ok but methinks that less is more balanced\n"},{"title":"baked salmon","section":"fish","tags":["fish"],"description":"From [Easy Baked Salmon Recipe | Cooking with Dog](https://youtu.be/CRXC7pRNh6g).\n\nServes 1.\n\n## tools\n\n- parchment paper\n- aluminium foil\n\n### easy ponzu\n\n- 30 ml lemon juice\n- 30 ml soy sauce\n","preparation":"- salt both side of the salmon and leave sit for 15\"\n- cut green onion and mushrooms\n- place down foil and parchment paper on top of it\n- put 2/3 of onion and mushrooms in the middle of parchment paper\n- sprinkle with salt, pepper and sake\n- remove moisture from salmon and sprinkle some sake on top of it\n- add salmon on top of the veggies, sprinkle some more salt and pepper and add the rest of veggies\n- close the aluminium foil\n- throw in oven for ~20 min\n- open the package, add butter and ponzu on top of it\n- serve with the package\n","ingredients":["salmon fillet","a pinch o'salt or twenty","2 coffeespn sake","40g long green onion","30g mushrooms (mix of shimeji and maitake)","pepper pepper pepper","½ spn butter"],"notes":"On the video they recommend regular onion to substitute the long green onion but leek works fine too. Suggested mushrooms replacement is either enoki or shiitake. I would not recommend to replace with chestnut (that are widely available in supermarkets, at least in the uk) as the taste is very different.\n"},{"title":"sazerac","section":"drinks","tags":["drinks"],"description":"I didn't get how good this is until I tried with actual rye (used to only have scotch around).\nrecipe from [Truffles On The Rocks](https://youtu.be/zkUay6o9gBE), adapted for lack of the right bitters.\n","preparation":"stir with ice, spray a chilled tumbler glass with absinthe before pouring over. express oils of lemon and discard.\n","ingredients":["60ml rye whisky","7.5ml simple syrup","2dash angostura bitters","3sprays absinthe","lemon zest"],"notes":"I made it with a templeton 4yr - it's fantastic. had to replace peychauds (in the original recipe) for angostura because that's what I had.\n\nTOTR's recipe also uses 2 dashes absinthe stirred in - I prefer not to and go lighter on it\n"},{"title":"mango cheesecake","section":"sweets","tags":["sweets"],"description":"de licious.\nadapted from [Cooking Tree](https://youtu.be/qxQEr5HS2Eo), with grams conversions, single tier and coercing strawberries in mangoes.\n\nserves: some people for some days or 1 Foo for 1 sitting.\n","preparation":"TODO\n","ingredients":["90g biscuits x2 (?)","40g butter x2 (?)","350g cream cheese","95g sugar","15g lemon","10g gelatin","210g cream","250g strawberries (mangoes?)","5g vanilla"],"notes":"not sure what those x2 noted on the postit were."},{"title":"americano","section":"drinks","tags":["drinks"],"description":"I like the ratios from [Difford's](https://www.diffordsguide.com/cocktails/recipe/61/americano) for this one. I'm particular with the booze-to-soda ratio and this works well.\n","preparation":"build in tall glass filled with ice. add campari and vermouth first, stir to chill and dilute. top with soda water, give a gentle stir to combine without loosing too much fizz.\n","ingredients":["45ml campari","45ml sweet vermouth","75ml soda water","orange slice for garnish"],"notes":""},{"title":"boulevardier","section":"drinks","tags":["drinks"],"description":"kindalikenegroni, but with whisky\n","preparation":"fill tumbler glass with ice, pour all ingredients in glass and give a long stir to dilute. top with more ice.\n","ingredients":["40ml blended whisky","20ml campari","20ml sweet vermouth"],"notes":"original recipe calls for bourboun or rye whisky but I tend to do everything with blended scotch instead\n"},{"title":"savory glazed chicken","section":"meat","tags":["meat"],"description":"from [Grilled Chicken Drumsticks with Savory Caramel](https://www.bonappetit.com/recipe/chicken-drumsticks-with-savory-caramel) with some adjustments because curry over cumin and grating lemongrass is a nightmare\n","preparation":"zest lemon, grate garlic. prep chicken however is fit to the piece you're cooking and season it with salt. preheat oven at 200.\n\nbring garlic, lemon zest, sugar, vinegar, red pepper flakes, curry, pepper and 120ml water toa  boil and cooke until reduced by half (about 10m). let cool and add fish sauce. reseve some sauce for serving.\n\noven chicken and cook until almost ready (20m?), then turn oven up to 250 grill, glaze chicken and cook on top shelf to char the glaze, turning and adding glaze as needed (about 3m per side)\n","ingredients":["4 garlic cloves","1 lemon","120ml sugar","60ml rice vinegar","1spn red pepper flakes","1spn curry","1/2spn ground black pepper","3spn fish sauce","chicken"],"notes":"pick whichever chicken part you want, original recipe calls for drumsticks and it's brilliant with them but wings work well too. I'm sure this would be great on pork ribs too, didn't try yet tho\n"},{"title":"naked and famous","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients in a shaker with ice. double strain in a coupe glass.\n","ingredients":["22.5ml mezcal","22.5ml lime juice","22.5ml aperol","22.5ml chartreuse yellow"],"notes":""},{"title":"lemon salmon","section":"fish","tags":["fish"],"description":"From [Andy Makes Grilled Salmon with Lemon Sauce](https://video.bonappetit.com/watch/andy-makes-grilled-salmon-with-lemon-sauce).\n\nServes 1 or 2 if you make some good sides.\n","preparation":"scale salmon, season with salt on both sides, coat evenly with a layer of evoo.\n\nchop shallot fine, peel lemon and chop skin, put all the ingredients except basil in a bowl (and squeeze the lemon core in it) and mix.\n\ncook salmon skin down, covered, for 6-8m. serve with sauce all around and garnish with basil.\n","ingredients":["2 salmon fillets","1 lemon","1 shallot",".5spn sesame seeds",".5spn honey",".5spn sesame oil",".5spn pepper","80ml evoo","salt","basil"],"notes":"the best thing you can do is to use toasted szechuan pepper instead of regular black pepper, it really shines in this sauce.\n"},{"title":"negroni","section":"drinks","tags":["drinks"],"description":"","preparation":"fill a tumbler glass with ice and add all ingredients. stir to chill and dilute, top with more ice and an orange slice\n","ingredients":["25ml campari","25ml sweet vermouth","25ml london dry gin"],"notes":"I keep forgetting that damn orange for some reason\n\neast london batch #2 is splendid in this\n"},{"title":"penicillin","section":"drinks","tags":["drinks"],"description":"as seen on [cocktail chemistry](https://youtu.be/JjW8-sBejm0), noted down here for quick access.\n","preparation":"mix blended scotch, lemon juice and syrups in a shaker with ice. double strain in a rocks glass with a big ice chunk in it. float single malt on top.\n","ingredients":["11ml [ginger syrup](https://github.com/caligin/actual-cookbook/tree/master/drinks/ginger-syrup.md)","11ml [honey syrup](https://github.com/caligin/actual-cookbook/tree/master/drinks/honey-syrup.md)","22ml lemon juice","60ml blended scotch","1 cspn smoky single malt whisky"],"notes":"lemon yield calls for approx half a lemon\n"},{"title":"sugar syrup","section":"drinks","tags":["drinks"],"description":"you'll need this for the aleksandr\n\n## tools\n\n- small saucepan\n- measuring cup\n","preparation":"add water and half the sugar in a saucepan and set to low heat. stir until all sugar dissolved. add the remaining sugar and keep stirring until dissolved. cool and pour is some container for later use.\n","ingredients":["200ml sugar","100ml water"],"notes":"can use any amount as long as the ratio is 2:1. depends on how much you need, really.\n\nrumors say that a splash of vodka helps preserving for longer.\n\nusing different types of sugar yields different flavours.\n\nto add flavouring to the syrup add the flavour things while warming up the base.\n"},{"title":"angry russian","section":"drinks","tags":["drinks"],"description":"White russian, but with foamy milk.\n\n## tools\n\n- shaker\n- jigger for the measures\n- strainer\n","preparation":"Throw kalhua, vodka and ice in a glass (old fahioned glass works best)\n\nThrow milk in shaker with ice and shake angrily. After a while some milk will still be liquid and not foamy, use the strainer to pour it in a second container/glass, then remove the strainer and slowly pour the foamy milk in the glass. If it has the right consistency it will layer effortlessly. Optionally repeat shaking with the remaining milk.\n","ingredients":["1 sjig kalhua","1 bjig vodka (russian standard is my go-to one)","2 sjig milk (not sure which one, I think the one that linges in the fridge is uk's \"blue\" one, whatever that means)","ice"],"notes":"Don't forget to remove the milk that is still liquid before pouring or it will ruin the layering\n"},{"title":"grand fizz","section":"drinks","tags":["drinks"],"description":"","preparation":"build in wine or g&t glass with ice\n","ingredients":["45ml vodka","30ml st germain","15ml lime juice","60ml soda water"],"notes":"supposedly garnished with lime wedges but meh\n"},{"title":"crispy squid","section":"fish","tags":["fish"],"description":"TODO https://www.youtube.com/watch?v=vkce1iTsgpk\n\nscouring and cutting in bigger chunks recommended as it will take the batter on better, it was slipping off\n\ndo pat dry before dipping or the water will make explosive oil bubbles on the 170 round\n\ntry to do only 1 round at 170 maybe? suspect that a double fly is not necessary\n\ndon't use too much oil on the veg or they will be soggy for a while before you manage to make it crispy\n","preparation":"","ingredients":null,"notes":""},{"title":"chinese pickles","section":"other","tags":["other"],"description":"TODO reference http://www.thehongkongcookery.com/2013/03/chinese-pickles.html\n\nconversion from cups:\n- 230g vinegar (similar in millis???)\n- 200g sugar\n\ndouble as needed for container\n\nplus chillies\n\ncut carrots thin because they don't absorb well\n\nuse ridge cucumbers not cocktail cucumbers they absorb the brine waaaay better\n\nor ditch cucumbers altogether\n\nbatch #3 we did 500mills rice vinegar 400g soft brown sugar (forgot to buy white)\n","preparation":"","ingredients":null,"notes":""},{"title":"maboroshi tebasaki chicken","section":"meat","tags":["meat"],"description":"From: [やまちゃんの幻の手羽先♪　Spicy chicken wing♪（Maboroshino Tebasaki）](https://youtu.be/zushgTab99E)\n","preparation":"TODO\n","ingredients":["TODO"],"notes":"I went for a mix of green, white and black pepper instead of just cheap black and was pretty good.\n\nA brush is optional, you can do with a spoon but brush helps a lot in speading the sauce evenly.\n"},{"title":"pale mushroom tagliatelle","section":"pasta","tags":["pasta"],"description":"PaLe actually stands for Parsley & Lemon lol\n\ndon't have actual amounts so cook how much your heart tells you\n\nserves how many you want as long as you throw enough ingredients in it\n","preparation":"- mince garlic and parsley (not together) (and chilli if you want it) \n- slice mushrooms\n- set pot of water on high heat to boil\n- set pan at mid-high heat with oil\n- add garlic (and chilli?) and fry for a few seconds\n- add mushrooms and half parsley\n- when mushrooms are past halfway cooked add rest of parsely and squeeze lemon\n- when water boils, drop some coarse salt and tagliatelle in the pot\n- follow instructions on pasta pack for how long it takes to cook, stir occasionally\n- drain pasta, pour in sauce pan and toss with sauce to mix\n- sprinkle some extra pepper for maximum pepper freshness\n- top with some grated cheese\n- serve\n","ingredients":["tagliatelle","parsley","garlic","mushrooms","lemon","chilli or dried chilli flakes (optional)","grating cheese","coarse salt","pepper pepper pepper"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nChilli or chilli flakes optional for extra kick but very unnecessary\n"},{"title":"teriyaki","section":"sauce","tags":["sauce"],"description":"From: [How to make an easy and quick thick sweet teriyaki sauce IN UNDER 1 MIN!!!!!!](https://youtu.be/A9EoiCTNRIM)\n\nI can't have enough of this.\n\nEnough for: tow portions of teriyaki chicken/salmon and some leftover\n","preparation":"- pour everything in a small saucepan on high heat and stir until sugar dissolved\n- leave to cool down a little before using\n","ingredients":["3 spn soy sauce","2 spn sake","2 spn sugar"],"notes":""},{"title":"'nnacacioeppepe","section":"pasta","tags":["pasta"],"description":"I searched everywhere in london for *days* before realizing that this is actually made with pecorino romano and not \"a specific cheese called cacio\" (I did find something called cacioscamorza though, that is very nice but also doesn't have the right consistency for this dish).\n\nServes one or more people depending on how much ingredients you want to use\n","preparation":"- set pot of water on high heat to boil\n- grate cheese fine and mix toroughly with a little cold water to make a cream\n- add pepper and mix again\n- when water boils, drop some coarse salt and pasta in the pot\n- cook pasta to instructions then strain and quickly throw in the sauce while still hot\n- toss to coat, leave for a minute so that the heat from pasta makes the cheese stick\n","ingredients":["pecorino romano","spaghetti","pepper pepper pepper","pepper pepper pepper","pepper pepper pepper"],"notes":"Do not, under any circumstances, add the pasta in the water before it's boiling.\n\nI see a lot of recipes calling for doing fancy stuff with pasta's cooking water but a chef friend of mine tells me that he does with just cold water so I'll just go by that for now\n\nlotsa other videos around the interwebz toast the pepper before adding it, saying that it gets nicer flavour. afaik toasting pepper makes it lose flavour rather than enhancing so fuck that, just make sure that you crush it fresh. ofc idk really so if you can prove me wrong please do so.\n\nif you can't find pecorino romano this recipe works fine with a replacement cheese that is aged and firm and kinda similar flavour but only as long as you don't go around telling anyone. admitting cheese replacement in the wrong neighborhood can cause severe injury, loss of conciousness and death.\n\nI routinely fail at making this in a decent way (and I also never had one done professionally so I have no comparison either) so take whatever I write here with a (massive) pinch of (coarse) salt\n"},{"title":"baked fish filling","section":"fish","tags":["fish"],"description":"This is my favourite filling for baked fish. Just fill either sea bass or sea bream with it and throw in oven for some time.\n","preparation":"just mix everything together\n","ingredients":["olive oil","breadcrumbs","capers","garlic","parsley"],"notes":"TODO figure out exact measurements. capers are just a little\n"},{"title":"teriyaki salmon","section":"fish","tags":["fish"],"description":"From: [How to make salmon teriyaki - authentic recipe - 鮭の照り焼き](https://youtu.be/_fljDKY1cuY)\n\nServes 1.\n\n## tools\n\n- aluminium foil\n","preparation":"- apply a shallow X cut on the skin side of the salmon\n- heat a gulp of vegetable oil very hot (enough oil to barely cover the whole surface of the pan works yoi)\n- add salmon skin side dow\n- apply salt and white pepper on top of salmon\n- turn heat down to mid-low\n- cover salmon with foil and cook for ~7 min\n- flip and cook on flesh side ~3 min (keeping covered with foil)\n- add sake and turn to high heat to deglaze\n- once alcohol is consumed turn down heat again and add teriyaki sauce\n- have the teriyaki thicken while continuously pouring it over the fish\n- it's ready when the sauce looks sticky-ish (usually just a few minutes)\n","ingredients":["1 salmon fillet","vegetable oil","salt","white pepper","2 spn sake","3 spn teriyaki sauce"],"notes":"Fillet size is up to you, I go for what's sold as a 1-portion at supermarkets. That by the way comes in two thinner slices so the X incision is unnecessary. Also, you either have a very sharp knife or you risk demolishing the fish, just give up on the incision if your blade is not vorpal +5.\n\nI pour a random amount of sake directly from the bottle. The spannometric amount is \"a couple of gulps so it distributes evenly around the circumference of the pan\".\n\nSimilarly for the teriyaki sauce, from the pan where I prepare it, \"enough to have a thin uniform layer on the whole surface of the pan\".\n\nTbh last time I cooked this it was a bit dry, might be worth trying cook it a minute less per side or something. But it probably depends on your pan and stove so experiment's on you.\n"},{"title":"chorizo cod","section":"fish","tags":["fish"],"description":"from [Cod with Chorizo and Breadcrumbs](https://www.bonappetit.com/recipe/cod-with-chorizo-and-breadcrumbs), adapted for availability of stuff\n","preparation":"preheat oven at 220C, foil a tray. slice shallot, remove skin and dice chorizo, season cod with salt and pepper.\n\nheat olive oil in a pan at mid-high, add breadcrumbs and cook until lightly golden. add parsley, oregano, salt, pepper, give it a quick toss to mix and set aside in a bowl.\n\nwipe pan, add a little oil. add chorizo and shallot and cook until chorizo is crispy. set aside in a bowl and top with vinegar, salt and pepper.\n\nwipe pan, add oil, cook cod on 1 side for 3 minutes. transfer to tray, oven-roast for 5m.\n\nserve topped with chorizo and breadcrumbs\n","ingredients":["2 cod or haddock fillets","1 shallot","2inch chorizo","olive oil","salt","black pepper","parsley","oregano","balsamic vinegar","breadcrumbs"],"notes":""},{"title":"ossobuco with saffron risotto","section":"meat","tags":["meat"],"description":"sucking on the bone marrow is such a luxurious experience.\n\nthis recipe is a mashup taking inspirations from a few others: [Babish's one](https://www.youtube.com/watch?v=Jr9Is6NsFck), [one from Giallozafferano](https://ricette.giallozafferano.it/Ossibuchi-alla-milanese.html) and the risotto is from [this other one](https://www.greatbritishchefs.com/recipes/pigeon-saffron-risotto-recipe).\nI prefer the thing without tomato, especially if served with risotto.\n","preparation":"# for the ossobuco\n\nchop onion, 1 shallot, cerely, carrot, 2 cloves of garlic fine (or pulse in a food processor). mix flour with abundant salt and pepper and dust the ossibuchi well, pat off the excess.\n\nset a dutch oven on medium high. add some olive oil and melt 25g butter on it. add ossibuchi and leave untouched for 3-4 minutes to develop some crust. repeat on other side. pour a gulp or 2 of white wine, let evaporate then remove meat and set aside.\n\nadd the veg and cook on medium until browned. drop a gulp or two of white wine. return the meat to the dutch oven, add an extra bone marrow and cover with beef stock. set on low, cover, cook for 35m, flip, 25m more.\nremove lid, keep cooking until sauce reduced to desired levels, about 15 more minutes or whatever makes you happy.\n\nextract the extra marrow, chop fine and use in the risotto\n\n# for the gremolata\n\nchop parsley fine, grate 1 clove of garlic, zest half lemon. mix by hand, use to top the dish at the end.\n\n# for the risotto\n\nchop 1 shallot fine. set a pan with olive oil on medium, add shallot to sweat for a few minutes until golden. add rice and few pinches of salt and cook for 1 more minute until translucent. add some generous gulps of white wine and let absorb.\nadd half the saffron and start adding in stock, a little at a time, waiting until absorbed until adding more. after 10 minutes add the rest of saffron. continue until rice gets to the desired consistency, likely about 30 minutes total. you will likely have spare stock.\n\nremove from heat and stir in 20g butter, pecorino and the extra marrow cooked with the ossobuco.\n\n# plating\n\nplate risotto first, put an ossobuco on top of it, then pour some ossobuco sauce all over and top with gremolata.\n","ingredients":["2 ossibuchi","50ml flour","500ml beef stock","2 carrots","4 stalks celery",".5 onion","2 shallots","3 garlic cloves","1 bone marrow","140g arborio rice","1g saffron","50g butter","30g pecorino romano","small bunch of parsley","zest of .5 lemon"],"notes":""},{"title":"whisky sour","section":"drinks","tags":["drinks"],"description":"","preparation":"mix all ingredients in a shaker without ice. vigorous shake to foam. add ice to shaker. shake to dilute and chill. double strain in a coupe glass.\n","ingredients":["30ml naked grouse","30ml laphroaig select","30ml lemon juice","15ml simple syrup","30ml egg white","1dash angostura or orange bitters"],"notes":"can replace naked grouse for any blended scotch and laphroaig for any smoky or peaty scotch.\n"},{"title":"chorizo scotch eggs","section":"meat","tags":["meat"],"description":"From?\n\nBrewdog Camden used to serve some chorizo scotch eggs that are absolutely delicious so I tried to make them at home adapting some recipe I forgot about.\n\nConclusions: preparing scotch eggs can be long and messy, I'm not entirely sure I'm up for doing it again anytime soon.\n","preparation":"- soft-boil egg (6 min in boiling water then put in ice bath)\n- chop chorizo fine and try not to get mad\n- same with cheese\n- mix chorizo with cheese and pork until uniform-ish\n- use the mix to make a meatball around the softboiled egg\n- dust with flour\n- coat in egg\n- coat in breadcrumbs\n- repeat the two steps above for a thicker coating\n- deep fry until browned\n- dry and keep in fridge overnight\n- serve cold and with a side with some good mustard with grains\n","ingredients":["(how much?) sausages (I think I used cumberland but pork chipotlas are probs better. Might try with mince instead of sausages next time).","1 egg to softboil","more egg for the breading (1 should be enough for covering ~4)","some chorizo","some cheese (1 slice of cheddar methinks?)","flour","breadcrumbs","vegetable oil"],"notes":"So when I did this I got some very firm chorizo so chopping it was an absolute nightmare. If you can get your hands on some soft chorizo go for it.\n\nTODO find quantities and frying temp/time and I think something else is missing too\n"},{"title":"celery gose","section":"drinks","tags":["drinks"],"description":"\"I want to brew a rice beer but idk wtf I'mdoing and btw, hops!\"\n\n## tools\n\n- brewing kit\n","preparation":"- mash in at 75c, keep mash at 62-70c for 75m\n- mash out 75c\n- have sparge water ready at 75c+, sparge\n- boil 60m, follow indications in ingredients for hop timing\n- cold break to 21c, insert in fermenter areating wort well\n- pitch dry yeast on top surface, no need to shake\n- after fermentaiton end (give it somehow like 10d) add the dryhopping and let sit for 3d\n- chill in fridge at 3c for 1d\n- bottle\n","ingredients":["1000g extra pale","100g flaked rice","100g crystal malt","2.3l water for mash","3.8lt water for sparge","30g first gold 60m","9g east kent goldings 40m","9g fuggles 30m","1g irish moss 15m","12g citra 10m","20g amarillo dry 3d","4g safale us-05"],"notes":""}]}